zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_exti.h
/**
  ******************************************************************************
  * @file    stm32mp2xx_ll_exti.h
  * @author  MCD Application Team
  * @brief   Header file of EXTI LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32MP2xx_LL_EXTI_H
#define __STM32MP2xx_LL_EXTI_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx.h"

/** @addtogroup STM32MP2xx_LL_Driver
  * @{
  */

#if defined(EXTI1) || defined(EXTI2)

/** @defgroup EXTI_LL EXTI
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
#define LL_EXTI_REGISTER_PINPOS_SHFT        16U   /*!< Define used to shift pin position in EXTICR register */

/* Private Macros ------------------------------------------------------------*/
/**
  * @brief  Driver macro reserved for internal use: set a pointer to
  *         a register from a register basis from which an offset
  *         is applied.
  * @param  __REG__ Register basis from which the offset is applied.
  * @param  __REG_OFFFSET__ Offset to be applied (unit: number of registers).
  * @retval Pointer to register address
  */
#define __EXTI_PTR_REG_OFFSET(__REG__, __REG_OFFFSET__)                         \
  ((__IO uint32_t *)((uint32_t) ((uint32_t)(&(__REG__)) + ((__REG_OFFFSET__) << 2UL))))

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup EXTI_LL_Private_Macros EXTI Private Macros
  * @{
  */


#if defined (EXTI1)
#define IS_LL_EXTI1_LINE_0_31(__VALUE__)              (( (__VALUE__) & ~LL_EXTI1_LINE_ALL_0_31 ) == 0x00000000U)
#define IS_LL_EXTI1_LINE_32_63(__VALUE__)             (( (__VALUE__) & ~LL_EXTI1_LINE_ALL_32_63) == 0x00000000U)
#define IS_LL_EXTI1_LINE_64_95(__VALUE__)             (( (__VALUE__) & ~LL_EXTI1_LINE_ALL_64_95) == 0x00000000U)

#define IS_LL_EXTI1_DIRECT_LINE_0_31(__VALUE__)       (( (__VALUE__) & ~LL_EXTI1_DIRECT_LINE_ALL_0_31 ) == 0x00000000U)
#define IS_LL_EXTI1_DIRECT_LINE_32_63(__VALUE__)      (( (__VALUE__) & ~LL_EXTI1_DIRECT_LINE_ALL_32_63) == 0x00000000U)
#define IS_LL_EXTI1_DIRECT_LINE_64_95(__VALUE__)      (( (__VALUE__) & ~LL_EXTI1_DIRECT_LINE_ALL_64_95) == 0x00000000U)

#define IS_LL_EXTI1_CONFIG_LINE_0_31(__VALUE__)       (( (__VALUE__) & ~LL_EXTI1_CONFIG_LINE_ALL_0_31 ) == 0x00000000U)
#define IS_LL_EXTI1_CONFIG_LINE_32_63(__VALUE__)      (( (__VALUE__) & ~LL_EXTI1_CONFIG_LINE_ALL_32_63) == 0x00000000U)
#define IS_LL_EXTI1_CONFIG_LINE_64_95(__VALUE__)      (( (__VALUE__) & ~LL_EXTI1_CONFIG_LINE_ALL_64_95) == 0x00000000U)
#endif /* EXTI1 */

#define IS_LL_EXTI2_LINE_0_31(__VALUE__)              (( (__VALUE__) & ~LL_EXTI2_LINE_ALL_0_31 ) == 0x00000000U)
#define IS_LL_EXTI2_LINE_32_63(__VALUE__)             (( (__VALUE__) & ~LL_EXTI2_LINE_ALL_32_63) == 0x00000000U)
#define IS_LL_EXTI2_LINE_64_95(__VALUE__)             (( (__VALUE__) & ~LL_EXTI2_LINE_ALL_64_95) == 0x00000000U)

#define IS_LL_EXTI2_DIRECT_LINE_0_31(__VALUE__)       (( (__VALUE__) & ~LL_EXTI2_DIRECT_LINE_ALL_0_31 ) == 0x00000000U)
#define IS_LL_EXTI2_DIRECT_LINE_32_63(__VALUE__)      (( (__VALUE__) & ~LL_EXTI2_DIRECT_LINE_ALL_32_63) == 0x00000000U)
#define IS_LL_EXTI2_DIRECT_LINE_64_95(__VALUE__)      (( (__VALUE__) & ~LL_EXTI2_DIRECT_LINE_ALL_64_95) == 0x00000000U)

#define IS_LL_EXTI2_CONFIG_LINE_0_31(__VALUE__)       (( (__VALUE__) & ~LL_EXTI2_CONFIG_LINE_ALL_0_31 ) == 0x00000000U)
#define IS_LL_EXTI2_CONFIG_LINE_32_63(__VALUE__)      (( (__VALUE__) & ~LL_EXTI2_CONFIG_LINE_ALL_32_63) == 0x00000000U)
#define IS_LL_EXTI2_CONFIG_LINE_64_95(__VALUE__)      (( (__VALUE__) & ~LL_EXTI2_CONFIG_LINE_ALL_64_95) == 0x00000000U)

#if defined (EXTI1)
#define IS_LL_EXTI_LINE_0_31(__INSTANCE__, __VALUE__)                          \
  (   ( ( (__INSTANCE__) == EXTI1) && IS_LL_EXTI1_LINE_0_31( (__VALUE__) ) ) \
      ||                                                                        \
      ( ( (__INSTANCE__) == EXTI2) && IS_LL_EXTI2_LINE_0_31( (__VALUE__) ) ) )
#else
#define IS_LL_EXTI_LINE_0_31(__INSTANCE__, __VALUE__)      (((__INSTANCE__) == EXTI2) &&\
                                                            IS_LL_EXTI2_LINE_0_31(__VALUE__))
#endif /* EXTI1 */

#if defined (EXTI1)
#define IS_LL_EXTI_LINE_32_63(__INSTANCE__, __VALUE__)                          \
  (   ( ( (__INSTANCE__) == EXTI1) && IS_LL_EXTI1_LINE_32_63( (__VALUE__) ) ) \
      ||                                                                         \
      ( ( (__INSTANCE__) == EXTI2) && IS_LL_EXTI2_LINE_32_63( (__VALUE__) ) ) )
#else
#define IS_LL_EXTI_LINE_32_63(__INSTANCE__, __VALUE__)      (((__INSTANCE__) == EXTI2) &&\
                                                             IS_LL_EXTI2_LINE_32_63(__VALUE__))
#endif /* EXTI1 */

#if defined (EXTI1)
#define IS_LL_EXTI_LINE_64_95(__INSTANCE__, __VALUE__)                          \
  (   ( ( (__INSTANCE__) == EXTI1) && IS_LL_EXTI1_LINE_64_95( (__VALUE__) ) ) \
      ||                                                                        \
      ( ( (__INSTANCE__) == EXTI2) && IS_LL_EXTI2_LINE_64_95( (__VALUE__) ) ) )
#else
#define IS_LL_EXTI_LINE_64_95(__INSTANCE__, __VALUE__)      (((__INSTANCE__) == EXTI2) &&\
                                                             IS_LL_EXTI2_LINE_64_95(__VALUE__))
#endif /* EXTI1 */

#if defined (EXTI1)
#define IS_LL_EXTI_DIRECT_LINE_0_31(__INSTANCE__, __VALUE__)                          \
  (   ( ( (__INSTANCE__) == EXTI1) && IS_LL_DIRECT_EXTI1_LINE_0_31( (__VALUE__) ) ) \
      ||                                                                        \
      ( ( (__INSTANCE__) == EXTI2) && IS_LL_DIRECT_EXTI2_LINE_0_31( (__VALUE__) ) ) )
#else
#define IS_LL_EXTI_DIRECT_LINE_0_31(__INSTANCE__, __VALUE__)      (((__INSTANCE__) == EXTI2) &&\
                                                                   IS_LL_EXTI2_DIRECT_LINE_0_31(__VALUE__))
#endif /* EXTI1 */

