zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_exti.h
#if defined (EXTI1)
#define IS_LL_EXTI_DIRECT_LINE_32_63(__INSTANCE__, __VALUE__)                          \
  (   ( ( (__INSTANCE__) == EXTI1) && IS_LL_DIRECT_EXTI1_LINE_32_63( (__VALUE__) ) ) \
      ||                                                                         \
      ( ( (__INSTANCE__) == EXTI2) && IS_LL_DIRECT_EXTI2_LINE_32_63( (__VALUE__) ) ) )
#else
#define IS_LL_EXTI_DIRECT_LINE_32_63(__INSTANCE__, __VALUE__)      (((__INSTANCE__) == EXTI2) &&\
                                                                    IS_LL_EXTI2_DIRECT_LINE_32_63(__VALUE__))
#endif /* EXTI1 */

#if defined (EXTI1)
#define IS_LL_EXTI_DIRECT_LINE_64_95(__INSTANCE__, __VALUE__)                          \
  (   ( ( (__INSTANCE__) == EXTI1) && IS_LL_EXTI1_DIRECT_LINE_64_95( (__VALUE__) ) ) \
      ||                                                                        \
      ( ( (__INSTANCE__) == EXTI2) && IS_LL_EXTI2_DIRECT_LINE_64_95( (__VALUE__) ) ) )
#else
#define IS_LL_EXTI_DIRECT_LINE_64_95(__INSTANCE__, __VALUE__)      (((__INSTANCE__) == EXTI2) &&\
                                                                    IS_LL_EXTI2_DIRECT_LINE_64_95(__VALUE__))
#endif /* EXTI1 */

#if defined (EXTI1)
#define IS_LL_EXTI_CONFIG_LINE_0_31(__INSTANCE__, __VALUE__)                          \
  (   ( ( (__INSTANCE__) == EXTI1) && IS_LL_EXTI1_CONFIG_LINE_0_31( (__VALUE__) ) ) \
      ||                                                                        \
      ( ( (__INSTANCE__) == EXTI2) && IS_LL_EXTI2_CONFIG_LINE_0_31( (__VALUE__) ) ) )
#else
#define IS_LL_EXTI_CONFIG_LINE_0_31(__INSTANCE__, __VALUE__)      (((__INSTANCE__) == EXTI2) &&\
                                                                   IS_LL_EXTI2_CONFIG_LINE_0_31(__VALUE__))
#endif /* EXTI1 */

#if defined (EXTI1)
#define IS_LL_EXTI_CONFIG_LINE_32_63(__INSTANCE__, __VALUE__)                          \
  (   ( ( (__INSTANCE__) == EXTI1) && IS_LL_EXTI1_CONFIG_LINE_32_63( (__VALUE__) ) ) \
      ||                                                                         \
      ( ( (__INSTANCE__) == EXTI2) && IS_LL_EXTI2_CONFIG_LINE_32_63( (__VALUE__) ) ) )
#else
#define IS_LL_EXTI_CONFIG_LINE_32_63(__INSTANCE__, __VALUE__)      (((__INSTANCE__) == EXTI2) &&\
                                                                    IS_LL_EXTI2_CONFIG_LINE_32_63(__VALUE__))
#endif /* EXTI1 */

#if defined (EXTI1)
#define IS_LL_EXTI_CONFIG_LINE_64_95(__INSTANCE__, __VALUE__)                          \
  (   ( ( (__INSTANCE__) == EXTI1) && IS_LL_EXTI1_CONFIG_LINE_64_95( (__VALUE__) ) ) \
      ||                                                                        \
      ( ( (__INSTANCE__) == EXTI2) && IS_LL_EXTI2_CONFIG_LINE_64_95( (__VALUE__) ) ) )
#else
#define IS_LL_EXTI_CONFIG_LINE_64_95(__INSTANCE__, __VALUE__)      (((__INSTANCE__) == EXTI2) &&\
                                                                    IS_LL_EXTI2_CONFIG_LINE_64_95(__VALUE__))
#endif /* EXTI1 */

/* type cast to int is required to prevent warning when using some compilers (pointless comparison of
 * unsigned integer with zero) */
#if defined (EXTI1)
#define IS_EXTI1_EVT_CID_VALID(__VALUE__)               \
  ( ( ((__VALUE__) >=  0U) && ( (__VALUE__) <= 19U) ) || \
    ( ((__VALUE__) >= 21U) && ( (__VALUE__) <= 34U) ) || \
    ( ((__VALUE__) >= 36U) && ( (__VALUE__) <= 50U) ) || \
    ( ((__VALUE__) >= 52U) && ( (__VALUE__) <= 57U) ) || \
    ( ((__VALUE__) >= 59U) && ( (__VALUE__) <= 62U) ) || \
    ( ((__VALUE__) >= 64U) && ( (__VALUE__) <= 65U) ) || \
    ( ((__VALUE__) >= 67U) && ( (__VALUE__) <= 68U) ) || \
    ((__VALUE__) == 70U)                            || \
    ( ((__VALUE__) >= 72U) && ( (__VALUE__) <= 84U)) )
#endif /* EXTI1 */

#define IS_EXTI2_EVT_CID_VALID(__VALUE__)                 \
  ( ( ((__VALUE__) >=  0U) && ( (__VALUE__) <= 27U)) || \
    ( ((__VALUE__) >= 29U) && ( (__VALUE__) <= 31U)) || \
    ( ((__VALUE__) >= 33U) && ( (__VALUE__) <= 38U)) || \
    ( ((__VALUE__) >= 40U) && ( (__VALUE__) <= 44U)) || \
    ( ((__VALUE__) >= 46U) && ( (__VALUE__) <= 56U)) || \
    ( ((__VALUE__) >= 59U) && ( (__VALUE__) <= 70U)) || \
    ((__VALUE__) == 76U) )

#if defined (EXTI1)
#define IS_EXTI_EVT_CID_VALID(__INSTANCE__, __VALUE__)                          \
  (   ( ( (__INSTANCE__) == EXTI1) && IS_EXTI1_EVT_CID_VALID( (__VALUE__) ) ) \
      ||                                                                        \
      ( ( (__INSTANCE__) == EXTI2) && IS_EXTI2_EVT_CID_VALID( (__VALUE__) ) ) )
#else
#define IS_EXTI_EVT_CID_VALID(__INSTANCE__, __VALUE__)      (((__INSTANCE__) == EXTI2) &&\
                                                             IS_EXTI2_EVT_CID_VALID(__VALUE__))
#endif /* EXTI1 */


#if defined (EXTI1)
#define IS_LL_EXTI1_EVT_0_31(__VALUE__)              (0U)
#define IS_LL_EXTI1_EVT_32_63(__VALUE__)             (0U)
#define IS_LL_EXTI1_EVT_64_95(__VALUE__)             (( (__VALUE__) & ~LL_EXTI1_EVT_ALL_64_95) == 0x00000000U)
#endif  /* EXTI1 */

#define IS_LL_EXTI2_EVT_0_31(__VALUE__)              (( (__VALUE__) & ~LL_EXTI2_EVT_ALL_0_31 ) == 0x00000000U)
#define IS_LL_EXTI2_EVT_32_63(__VALUE__)             (( (__VALUE__) & ~LL_EXTI2_EVT_ALL_32_63) == 0x00000000U)
#define IS_LL_EXTI2_EVT_64_95(__VALUE__)             (0U)

#if defined (EXTI1)
#define IS_LL_EXTI_EVT_0_31(__INSTANCE__, __VALUE__)                          \
  (   ( ( (__INSTANCE__) == EXTI1) && IS_LL_EXTI1_EVT_0_31( (__VALUE__) ) ) \
      ||                                                                        \
      ( ( (__INSTANCE__) == EXTI2) && IS_LL_EXTI2_EVT_0_31( (__VALUE__) ) ) )
#else
#define IS_LL_EXTI_EVT_0_31(__INSTANCE__, __VALUE__)      (((__INSTANCE__) == EXTI2) && IS_LL_EXTI2_EVT_0_31(__VALUE__))
#endif /* EXTI1 */

#if defined (EXTI1)
#define IS_LL_EXTI_EVT_32_63(__INSTANCE__, __VALUE__)                          \
  (   ( ( (__INSTANCE__) == EXTI1) && IS_LL_EXTI1_EVT_32_63( (__VALUE__) ) ) \
      ||                                                                         \
      ( ( (__INSTANCE__) == EXTI2) && IS_LL_EXTI2_EVT_32_63( (__VALUE__) ) ) )
#else
#define IS_LL_EXTI_EVT_32_63(__INSTANCE__, __VALUE__)      (((__INSTANCE__) == EXTI2) &&\
                                                            IS_LL_EXTI2_EVT_32_63(__VALUE__))
#endif /* EXTI1 */

