zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_exti.h
#if defined (EXTI1)
#define IS_LL_EXTI_EVT_64_95(__INSTANCE__, __VALUE__)                          \
  (   ( ( (__INSTANCE__) == EXTI1) && IS_LL_EXTI1_EVT_64_95( (__VALUE__) ) ) \
      ||                                                                        \
      ( ( (__INSTANCE__) == EXTI2) && IS_LL_EXTI2_EVT_64_95( (__VALUE__) ) ) )
#else
#define IS_LL_EXTI_EVT_64_95(__INSTANCE__, __VALUE__)      (((__INSTANCE__) == EXTI2) &&\
                                                            IS_LL_EXTI2_EVT_64_95(__VALUE__))
#endif /* EXTI1 */

#if defined (EXTI1)
#define IS_LL_EXTI1_SEC_0_31(__VALUE__)              (( (__VALUE__) & ~LL_EXTI1_SEC_ALL_0_31 ) == 0x00000000U)
#define IS_LL_EXTI1_SEC_32_63(__VALUE__)             (( (__VALUE__) & ~LL_EXTI1_SEC_ALL_32_63) == 0x00000000U)
#define IS_LL_EXTI1_SEC_64_95(__VALUE__)             (( (__VALUE__) & ~LL_EXTI1_SEC_ALL_64_95) == 0x00000000U)
#endif /* EXTI1 */

#define IS_LL_EXTI2_SEC_0_31(__VALUE__)              (( (__VALUE__) & ~LL_EXTI2_SEC_ALL_0_31 ) == 0x00000000U)
#define IS_LL_EXTI2_SEC_32_63(__VALUE__)             (( (__VALUE__) & ~LL_EXTI2_SEC_ALL_32_63) == 0x00000000U)
#define IS_LL_EXTI2_SEC_64_95(__VALUE__)             (( (__VALUE__) & ~LL_EXTI2_SEC_ALL_64_95) == 0x00000000U)

#if defined (EXTI1)
#define IS_LL_EXTI_SEC_0_31(__INSTANCE__, __VALUE__)                          \
  (   ( ( (__INSTANCE__) == EXTI1) && IS_LL_EXTI1_SEC_0_31( (__VALUE__) ) ) \
      ||                                                                        \
      ( ( (__INSTANCE__) == EXTI2) && IS_LL_EXTI2_SEC_0_31( (__VALUE__) ) ) )
#else
#define IS_LL_EXTI_SEC_0_31(__INSTANCE__, __VALUE__)      (((__INSTANCE__) == EXTI2) && IS_LL_EXTI2_SEC_0_31(__VALUE__))
#endif /* EXTI1 */

#if defined (EXTI1)
#define IS_LL_EXTI_SEC_32_63(__INSTANCE__, __VALUE__)                          \
  (   ( ( (__INSTANCE__) == EXTI1) && IS_LL_EXTI1_SEC_32_63( (__VALUE__) ) ) \
      ||                                                                         \
      ( ( (__INSTANCE__) == EXTI2) && IS_LL_EXTI2_SEC_32_63( (__VALUE__) ) ) )
#else
#define IS_LL_EXTI_SEC_32_63(__INSTANCE__, __VALUE__)      (((__INSTANCE__) == EXTI2) &&\
                                                            IS_LL_EXTI2_SEC_32_63(__VALUE__))
#endif /* EXTI1 */

#if defined (EXTI1)
#define IS_LL_EXTI_SEC_64_95(__INSTANCE__, __VALUE__)                          \
  (   ( ( (__INSTANCE__) == EXTI1) && IS_LL_EXTI1_SEC_64_95( (__VALUE__) ) ) \
      ||                                                                        \
      ( ( (__INSTANCE__) == EXTI2) && IS_LL_EXTI2_SEC_64_95( (__VALUE__) ) ) )
#else
#define IS_LL_EXTI_SEC_64_95(__INSTANCE__, __VALUE__)      (((__INSTANCE__) == EXTI2) &&\
                                                            IS_LL_EXTI2_SEC_64_95(__VALUE__))
#endif /* EXTI1 */

#if defined (EXTI1)
#define IS_LL_EXTI1_PRIV_0_31(__VALUE__)              (( (__VALUE__) & ~LL_EXTI1_PRIV_ALL_0_31 ) == 0x00000000U)
#define IS_LL_EXTI1_PRIV_32_63(__VALUE__)             (( (__VALUE__) & ~LL_EXTI1_PRIV_ALL_32_63) == 0x00000000U)
#define IS_LL_EXTI1_PRIV_64_95(__VALUE__)             (( (__VALUE__) & ~LL_EXTI1_PRIV_ALL_64_95) == 0x00000000U)
#endif /* EXTI1 */

#define IS_LL_EXTI2_PRIV_0_31(__VALUE__)              (( (__VALUE__) & ~LL_EXTI2_PRIV_ALL_0_31 ) == 0x00000000U)
#define IS_LL_EXTI2_PRIV_32_63(__VALUE__)             (( (__VALUE__) & ~LL_EXTI2_PRIV_ALL_32_63) == 0x00000000U)
#define IS_LL_EXTI2_PRIV_64_95(__VALUE__)             (( (__VALUE__) & ~LL_EXTI2_PRIV_ALL_64_95) == 0x00000000U)

#if defined (EXTI1)
#define IS_LL_EXTI_PRIV_0_31(__INSTANCE__, __VALUE__)                          \
  (   ( ( (__INSTANCE__) == EXTI1) && IS_LL_EXTI1_PRIV_0_31( (__VALUE__) ) ) \
      ||                                                                        \
      ( ( (__INSTANCE__) == EXTI2) && IS_LL_EXTI2_PRIV_0_31( (__VALUE__) ) ) )
#else
#define IS_LL_EXTI_PRIV_0_31(__INSTANCE__, __VALUE__)      (((__INSTANCE__) == EXTI2) &&\
                                                            IS_LL_EXTI2_PRIV_0_31(__VALUE__))
#endif /* EXTI1 */

#if defined (EXTI1)
#define IS_LL_EXTI_PRIV_32_63(__INSTANCE__, __VALUE__)                          \
  (   ( ( (__INSTANCE__) == EXTI1) && IS_LL_EXTI1_PRIV_32_63( (__VALUE__) ) ) \
      ||                                                                         \
      ( ( (__INSTANCE__) == EXTI2) && IS_LL_EXTI2_PRIV_32_63( (__VALUE__) ) ) )
#else
#define IS_LL_EXTI_PRIV_32_63(__INSTANCE__, __VALUE__)      (((__INSTANCE__) == EXTI2) &&\
                                                             IS_LL_EXTI2_PRIV_32_63(__VALUE__))
#endif /* EXTI1 */

#if defined (EXTI1)
#define IS_LL_EXTI_PRIV_64_95(__INSTANCE__, __VALUE__)                          \
  (   ( ( (__INSTANCE__) == EXTI1) && IS_LL_EXTI1_PRIV_64_95( (__VALUE__) ) ) \
      ||                                                                        \
      ( ( (__INSTANCE__) == EXTI2) && IS_LL_EXTI2_PRIV_64_95( (__VALUE__) ) ) )
#else
#define IS_LL_EXTI_PRIV_64_95(__INSTANCE__, __VALUE__)      (((__INSTANCE__) == EXTI2) &&\
                                                             IS_LL_EXTI2_PRIV_64_95(__VALUE__))
#endif /* EXTI1 */


/**
  * @}
  */
#endif /*USE_FULL_LL_DRIVER*/
/* Exported types ------------------------------------------------------------*/
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup EXTI_LL_ES_INIT EXTI Exported Init structure
  * @{
  */
typedef struct
{

  uint32_t Line_0_31;           /*!< Specifies the EXTI lines to be enabled or disabled for Lines in range 0 to 31.
                                     This parameter can be any combination of @ref LL_EXTI1_LINE_x or
                                     @ref LL_EXTI2_LINE_x */

  uint32_t Line_32_63;          /*!< Specifies the EXTI lines to be enabled or disabled for Lines in range 32 to 63.
                                     This parameter can be any combination of @ref LL_EXTI1_LINE_x or
                                     @ref LL_EXTI2_LINE_x */

  uint32_t Line_64_95;          /*!< Specifies the EXTI lines to be enabled or disabled for Lines in range 64 to 95.
                                     This parameter can be any combination of @ref LL_EXTI1_LINE_x or
                                     @ref LL_EXTI2_LINE_x */

  FunctionalState LineCommand;  /*!< Specifies the new state of the selected EXTI lines.
                                     This parameter can be set either to ENABLE or DISABLE */

  uint8_t Mode;                 /*!< Specifies the mode for the EXTI lines.
                                     This parameter can be a value of @ref EXTI_LL_EC_MODE. */

  uint8_t Trigger;              /*!< Specifies the trigger signal active edge for the EXTI lines.
                                     This parameter can be a value of @ref EXTI_LL_EC_TRIGGER. */
} LL_EXTI_InitTypeDef;

/**
  * @}
  */
#endif /*USE_FULL_LL_DRIVER*/

/* Exported constants --------------------------------------------------------*/
/** @defgroup EXTI_LL_Exported_Constants EXTI Exported Constants
  * @{
  */

