zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_exti.h
#if defined(EXTI1)
/** @defgroup LL_EXTI1_LINE_x EXTI1 Line x
  * @{
  */
#define LL_EXTI1_LINE_0                  EXTI1_IMR1_IM0    /*!< Extended line 0  */
#define LL_EXTI1_LINE_1                  EXTI1_IMR1_IM1    /*!< Extended line 1  */
#define LL_EXTI1_LINE_2                  EXTI1_IMR1_IM2    /*!< Extended line 2  */
#define LL_EXTI1_LINE_3                  EXTI1_IMR1_IM3    /*!< Extended line 3  */
#define LL_EXTI1_LINE_4                  EXTI1_IMR1_IM4    /*!< Extended line 4  */
#define LL_EXTI1_LINE_5                  EXTI1_IMR1_IM5    /*!< Extended line 5  */
#define LL_EXTI1_LINE_6                  EXTI1_IMR1_IM6    /*!< Extended line 6  */
#define LL_EXTI1_LINE_7                  EXTI1_IMR1_IM7    /*!< Extended line 7  */
#define LL_EXTI1_LINE_8                  EXTI1_IMR1_IM8    /*!< Extended line 8  */
#define LL_EXTI1_LINE_9                  EXTI1_IMR1_IM9    /*!< Extended line 9  */
#define LL_EXTI1_LINE_10                 EXTI1_IMR1_IM10   /*!< Extended line 10 */
#define LL_EXTI1_LINE_11                 EXTI1_IMR1_IM11   /*!< Extended line 11 */
#define LL_EXTI1_LINE_12                 EXTI1_IMR1_IM12   /*!< Extended line 12 */
#define LL_EXTI1_LINE_13                 EXTI1_IMR1_IM13   /*!< Extended line 13 */
#define LL_EXTI1_LINE_14                 EXTI1_IMR1_IM14   /*!< Extended line 14 */
#define LL_EXTI1_LINE_15                 EXTI1_IMR1_IM15   /*!< Extended line 15 */
#define LL_EXTI1_LINE_16                 EXTI1_IMR1_IM16   /*!< Extended line 16 */
#define LL_EXTI1_LINE_17                 EXTI1_IMR1_IM17   /*!< Extended line 17 */
#define LL_EXTI1_LINE_18                 EXTI1_IMR1_IM18   /*!< Extended line 18 */
#define LL_EXTI1_LINE_19                 EXTI1_IMR1_IM19   /*!< Extended line 19 */
#define LL_EXTI1_LINE_21                 EXTI1_IMR1_IM21   /*!< Extended line 21 */
#define LL_EXTI1_LINE_22                 EXTI1_IMR1_IM22   /*!< Extended line 22 */
#define LL_EXTI1_LINE_23                 EXTI1_IMR1_IM23   /*!< Extended line 23 */
#define LL_EXTI1_LINE_24                 EXTI1_IMR1_IM24   /*!< Extended line 24 */
#define LL_EXTI1_LINE_25                 EXTI1_IMR1_IM25   /*!< Extended line 25 */
#define LL_EXTI1_LINE_26                 EXTI1_IMR1_IM26   /*!< Extended line 26 */
#define LL_EXTI1_LINE_27                 EXTI1_IMR1_IM27   /*!< Extended line 27 */
#define LL_EXTI1_LINE_28                 EXTI1_IMR1_IM28   /*!< Extended line 28 */
#define LL_EXTI1_LINE_29                 EXTI1_IMR1_IM29   /*!< Extended line 29 */
#define LL_EXTI1_LINE_30                 EXTI1_IMR1_IM30   /*!< Extended line 30 */
#define LL_EXTI1_LINE_31                 EXTI1_IMR1_IM31   /*!< Extended line 31 */
#define LL_EXTI1_LINE_ALL_0_31 \
  ( LL_EXTI1_LINE_0  | LL_EXTI1_LINE_1  | LL_EXTI1_LINE_2 | \
    LL_EXTI1_LINE_3  | LL_EXTI1_LINE_4  | LL_EXTI1_LINE_5 | \
    LL_EXTI1_LINE_6  | LL_EXTI1_LINE_7  | LL_EXTI1_LINE_8 | \
    LL_EXTI1_LINE_9  | LL_EXTI1_LINE_10 | LL_EXTI1_LINE_11 | \
    LL_EXTI1_LINE_12 | LL_EXTI1_LINE_13 | LL_EXTI1_LINE_14 | \
    LL_EXTI1_LINE_15 | LL_EXTI1_LINE_16 | LL_EXTI1_LINE_17 | \
    LL_EXTI1_LINE_18 | LL_EXTI1_LINE_19 | \
    LL_EXTI1_LINE_21 | LL_EXTI1_LINE_22 | LL_EXTI1_LINE_23 | \
    LL_EXTI1_LINE_24 | LL_EXTI1_LINE_25 | LL_EXTI1_LINE_26 | \
    LL_EXTI1_LINE_27 | LL_EXTI1_LINE_28 | LL_EXTI1_LINE_29 | \
    LL_EXTI1_LINE_30 | LL_EXTI1_LINE_31)
/*!< All Extended line not reserved*/

#define LL_EXTI1_DIRECT_LINE_ALL_0_31 \
  ( LL_EXTI1_LINE_19 | \
    LL_EXTI1_LINE_21 | LL_EXTI1_LINE_22 | LL_EXTI1_LINE_23 | \
    LL_EXTI1_LINE_24 | LL_EXTI1_LINE_25 | LL_EXTI1_LINE_26 | \
    LL_EXTI1_LINE_27 | LL_EXTI1_LINE_28 | LL_EXTI1_LINE_29 | \
    LL_EXTI1_LINE_30 | LL_EXTI1_LINE_31)
/*!< All direct lines*/

#define LL_EXTI1_CONFIG_LINE_ALL_0_31 \
  ( LL_EXTI1_LINE_0  | LL_EXTI1_LINE_1  | LL_EXTI1_LINE_2 | \
    LL_EXTI1_LINE_3  | LL_EXTI1_LINE_4  | LL_EXTI1_LINE_5 | \
    LL_EXTI1_LINE_6  | LL_EXTI1_LINE_7  | LL_EXTI1_LINE_8 | \
    LL_EXTI1_LINE_9  | LL_EXTI1_LINE_10 | LL_EXTI1_LINE_11 | \
    LL_EXTI1_LINE_12 | LL_EXTI1_LINE_13 | LL_EXTI1_LINE_14 | \
    LL_EXTI1_LINE_15 | LL_EXTI1_LINE_16 | LL_EXTI1_LINE_17 | \
    LL_EXTI1_LINE_18 )
/*!< All configurable lines */

#define LL_EXTI1_LINE_32                 EXTI1_IMR2_IM32   /*!< Extended line 32 */
#define LL_EXTI1_LINE_33                 EXTI1_IMR2_IM33   /*!< Extended line 33 */
#define LL_EXTI1_LINE_34                 EXTI1_IMR2_IM34   /*!< Extended line 34 */
/* no line 35 */
#define LL_EXTI1_LINE_36                 EXTI1_IMR2_IM36   /*!< Extended line 36 */
#define LL_EXTI1_LINE_37                 EXTI1_IMR2_IM37   /*!< Extended line 37 */
#define LL_EXTI1_LINE_38                 EXTI1_IMR2_IM38   /*!< Extended line 38 */
#define LL_EXTI1_LINE_39                 EXTI1_IMR2_IM39   /*!< Extended line 39 */
#define LL_EXTI1_LINE_40                 EXTI1_IMR2_IM40   /*!< Extended line 40 */
#define LL_EXTI1_LINE_41                 EXTI1_IMR2_IM41   /*!< Extended line 41 */
#define LL_EXTI1_LINE_42                 EXTI1_IMR2_IM42   /*!< Extended line 42 */
#define LL_EXTI1_LINE_43                 EXTI1_IMR2_IM43   /*!< Extended line 43 */
#define LL_EXTI1_LINE_44                 EXTI1_IMR2_IM44   /*!< Extended line 44 */
#define LL_EXTI1_LINE_45                 EXTI1_IMR2_IM45   /*!< Extended line 45 */
#define LL_EXTI1_LINE_46                 EXTI1_IMR2_IM46   /*!< Extended line 46 */
#define LL_EXTI1_LINE_47                 EXTI1_IMR2_IM47   /*!< Extended line 47 */
#define LL_EXTI1_LINE_48                 EXTI1_IMR2_IM48   /*!< Extended line 48 */
#define LL_EXTI1_LINE_49                 EXTI1_IMR2_IM49   /*!< Extended line 49 */
#define LL_EXTI1_LINE_50                 EXTI1_IMR2_IM50   /*!< Extended line 50 */
/* no line 51 */
#define LL_EXTI1_LINE_52                 EXTI1_IMR2_IM52   /*!< Extended line 52 */
#define LL_EXTI1_LINE_53                 EXTI1_IMR2_IM53   /*!< Extended line 53 */
#define LL_EXTI1_LINE_54                 EXTI1_IMR2_IM54   /*!< Extended line 54 */
#define LL_EXTI1_LINE_55                 EXTI1_IMR2_IM55   /*!< Extended line 55 */
#define LL_EXTI1_LINE_56                 EXTI1_IMR2_IM56   /*!< Extended line 56 */
#define LL_EXTI1_LINE_57                 EXTI1_IMR2_IM57   /*!< Extended line 57 */
/* no line 57 */
#define LL_EXTI1_LINE_59                 EXTI1_IMR2_IM59   /*!< Extended line 59 */
#define LL_EXTI1_LINE_60                 EXTI1_IMR2_IM60   /*!< Extended line 60 */
#define LL_EXTI1_LINE_61                 EXTI1_IMR2_IM61   /*!< Extended line 61 */
#define LL_EXTI1_LINE_62                 EXTI1_IMR2_IM62   /*!< Extended line 62 */
/* no line 63 */

#define LL_EXTI1_LINE_ALL_32_63 \
  ( LL_EXTI1_LINE_32 | LL_EXTI1_LINE_33 | LL_EXTI1_LINE_34 | \
    LL_EXTI1_LINE_36 | LL_EXTI1_LINE_37 | LL_EXTI1_LINE_38 | \
    LL_EXTI1_LINE_39 | LL_EXTI1_LINE_40 | LL_EXTI1_LINE_41 | \
    LL_EXTI1_LINE_42 | LL_EXTI1_LINE_43 | LL_EXTI1_LINE_44 | \
    LL_EXTI1_LINE_45 | LL_EXTI1_LINE_46 | LL_EXTI1_LINE_47 | LL_EXTI1_LINE_48 | \
    LL_EXTI1_LINE_49 | LL_EXTI1_LINE_50 | LL_EXTI1_LINE_52 | \
    LL_EXTI1_LINE_53 | LL_EXTI1_LINE_54 | LL_EXTI1_LINE_55 | \
    LL_EXTI1_LINE_56 | LL_EXTI1_LINE_57 | LL_EXTI1_LINE_59 | \
    LL_EXTI1_LINE_60 | LL_EXTI1_LINE_61 | LL_EXTI1_LINE_62 )
/*!< All direct line */

#define LL_EXTI1_DIRECT_LINE_ALL_32_63 \
  ( LL_EXTI1_LINE_32 | LL_EXTI1_LINE_33 | LL_EXTI1_LINE_34 | \
    LL_EXTI1_LINE_36 | LL_EXTI1_LINE_37 | LL_EXTI1_LINE_38 | \
    LL_EXTI1_LINE_39 | LL_EXTI1_LINE_40 | LL_EXTI1_LINE_41 | \
    LL_EXTI1_LINE_42 | \
    LL_EXTI1_LINE_46 | LL_EXTI1_LINE_47 | LL_EXTI1_LINE_48 | \
    LL_EXTI1_LINE_49 | LL_EXTI1_LINE_50 | LL_EXTI1_LINE_52 | \
    LL_EXTI1_LINE_53 | LL_EXTI1_LINE_54 | LL_EXTI1_LINE_55 | \
    LL_EXTI1_LINE_56 | LL_EXTI1_LINE_57 | LL_EXTI1_LINE_59 | \
    LL_EXTI1_LINE_60 | LL_EXTI1_LINE_61 | LL_EXTI1_LINE_62 )
/*!< All Extended line not reserved*/

