zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_exti.h
#define LL_EXTI1_CONFIG_LINE_ALL_32_63 \
  ( LL_EXTI1_LINE_43 | LL_EXTI1_LINE_44 | LL_EXTI1_LINE_45  )
/*!< All configurable lines */

#define LL_EXTI1_LINE_64                 EXTI1_IMR3_IM64   /*!< Extended line 64 */
#define LL_EXTI1_LINE_65                 EXTI1_IMR3_IM65   /*!< Extended line 65 */
#define LL_EXTI1_LINE_67                 EXTI1_IMR3_IM67   /*!< Extended line 67 */
#define LL_EXTI1_LINE_68                 EXTI1_IMR3_IM68   /*!< Extended line 68 */
#define LL_EXTI1_LINE_70                 EXTI1_IMR3_IM70   /*!< Extended line 70 */
#define LL_EXTI1_LINE_72                 EXTI1_IMR3_IM72   /*!< Extended line 72 */
#define LL_EXTI1_LINE_73                 EXTI1_IMR3_IM73   /*!< Extended line 73 */
#define LL_EXTI1_LINE_74                 EXTI1_IMR3_IM74   /*!< Extended line 74 */
#define LL_EXTI1_LINE_75                 EXTI1_IMR3_IM75   /*!< Extended line 75 */
#define LL_EXTI1_LINE_76                 EXTI1_IMR3_IM76   /*!< Extended line 76 */
#define LL_EXTI1_LINE_77                 EXTI1_IMR3_IM77   /*!< Extended line 77 */
#define LL_EXTI1_LINE_78                 EXTI1_IMR3_IM78   /*!< Extended line 78 */
#define LL_EXTI1_LINE_79                 EXTI1_IMR3_IM79   /*!< Extended line 79 */
#define LL_EXTI1_LINE_80                 EXTI1_IMR3_IM80   /*!< Extended line 80 */
#define LL_EXTI1_LINE_81                 EXTI1_IMR3_IM81   /*!< Extended line 81 */
#define LL_EXTI1_LINE_82                 EXTI1_IMR3_IM82   /*!< Extended line 82 */
#define LL_EXTI1_LINE_83                 EXTI1_IMR3_IM83   /*!< Extended line 83 */
#define LL_EXTI1_LINE_84                 EXTI1_IMR3_IM84   /*!< Extended line 84 */

#define LL_EXTI1_LINE_ALL_64_95 \
  ( LL_EXTI1_LINE_64 | LL_EXTI1_LINE_65 | LL_EXTI1_LINE_67 | \
    LL_EXTI1_LINE_68 |  LL_EXTI1_LINE_70 | \
    LL_EXTI1_LINE_72 | LL_EXTI1_LINE_73 | \
    LL_EXTI1_LINE_74 | LL_EXTI1_LINE_75 | LL_EXTI1_LINE_76 | \
    LL_EXTI1_LINE_77 | LL_EXTI1_LINE_78 | LL_EXTI1_LINE_79 | \
    LL_EXTI1_LINE_80 | LL_EXTI1_LINE_81 | LL_EXTI1_LINE_82 | \
    LL_EXTI1_LINE_83 | LL_EXTI1_LINE_84)
/*!< All Extended line not reserved*/

#define LL_EXTI1_DIRECT_LINE_ALL_64_95 \
  ( LL_EXTI1_LINE_68 | LL_EXTI1_LINE_70 | \
    LL_EXTI1_LINE_72 | LL_EXTI1_LINE_74 | LL_EXTI1_LINE_75 | LL_EXTI1_LINE_76 | \
    LL_EXTI1_LINE_77 | LL_EXTI1_LINE_78 | LL_EXTI1_LINE_79 | LL_EXTI1_LINE_80 | \
    LL_EXTI1_LINE_81 | LL_EXTI1_LINE_82 )
/*!< All Extended line not reserved*/

#define LL_EXTI1_CONFIG_LINE_ALL_64_95 \
  ( LL_EXTI1_LINE_64 | LL_EXTI1_LINE_65 | LL_EXTI1_LINE_67 | \
    LL_EXTI1_LINE_73 | LL_EXTI1_LINE_83 | LL_EXTI1_LINE_84)
/*!< All Extended line not reserved*/

/**
  * @}
  */

/** @defgroup LL_EXTI1_SEC_x EXTI1 Secure x
  * @{
  */
#define LL_EXTI1_SEC_0              EXTI1_SECCFGR1_SEC0   /*!< Secure Line 0 */
#define LL_EXTI1_SEC_1              EXTI1_SECCFGR1_SEC1   /*!< Secure Line 1 */
#define LL_EXTI1_SEC_2              EXTI1_SECCFGR1_SEC2   /*!< Secure Line 2 */
#define LL_EXTI1_SEC_3              EXTI1_SECCFGR1_SEC3   /*!< Secure Line 3 */
#define LL_EXTI1_SEC_4              EXTI1_SECCFGR1_SEC4   /*!< Secure Line 4 */
#define LL_EXTI1_SEC_5              EXTI1_SECCFGR1_SEC5   /*!< Secure Line 5 */
#define LL_EXTI1_SEC_6              EXTI1_SECCFGR1_SEC6   /*!< Secure Line 6 */
#define LL_EXTI1_SEC_7              EXTI1_SECCFGR1_SEC7   /*!< Secure Line 7 */
#define LL_EXTI1_SEC_8              EXTI1_SECCFGR1_SEC8   /*!< Secure Line 8 */
#define LL_EXTI1_SEC_9              EXTI1_SECCFGR1_SEC9   /*!< Secure Line 9 */
#define LL_EXTI1_SEC_10             EXTI1_SECCFGR1_SEC10  /*!< Secure Line 10 */
#define LL_EXTI1_SEC_11             EXTI1_SECCFGR1_SEC11  /*!< Secure Line 11 */
#define LL_EXTI1_SEC_12             EXTI1_SECCFGR1_SEC12  /*!< Secure Line 12 */
#define LL_EXTI1_SEC_13             EXTI1_SECCFGR1_SEC13  /*!< Secure Line 13 */
#define LL_EXTI1_SEC_14             EXTI1_SECCFGR1_SEC14  /*!< Secure Line 14 */
#define LL_EXTI1_SEC_15             EXTI1_SECCFGR1_SEC15  /*!< Secure Line 15 */
#define LL_EXTI1_SEC_16             EXTI1_SECCFGR1_SEC16  /*!< Secure Line 16 */
#define LL_EXTI1_SEC_17             EXTI1_SECCFGR1_SEC17  /*!< Secure Line 17 */
#define LL_EXTI1_SEC_18             EXTI1_SECCFGR1_SEC18  /*!< Secure Line 18 */
#define LL_EXTI1_SEC_19             EXTI1_SECCFGR1_SEC19  /*!< Secure Line 19 */
/*#define LL_EXTI1_SEC_20              EXTI1_SECCFGR1_SEC20  !< Secure Line 20 */
#define LL_EXTI1_SEC_21             EXTI1_SECCFGR1_SEC21  /*!< Secure Line 21 */
#define LL_EXTI1_SEC_22             EXTI1_SECCFGR1_SEC22  /*!< Secure Line 22 */
#define LL_EXTI1_SEC_23             EXTI1_SECCFGR1_SEC23  /*!< Secure Line 23 */
#define LL_EXTI1_SEC_24             EXTI1_SECCFGR1_SEC24  /*!< Secure Line 24 */
#define LL_EXTI1_SEC_25             EXTI1_SECCFGR1_SEC25  /*!< Secure Line 25 */
#define LL_EXTI1_SEC_26             EXTI1_SECCFGR1_SEC26  /*!< Secure Line 26 */
#define LL_EXTI1_SEC_27             EXTI1_SECCFGR1_SEC27  /*!< Secure Line 27 */
#define LL_EXTI1_SEC_28             EXTI1_SECCFGR1_SEC28  /*!< Secure Line 28 */
#define LL_EXTI1_SEC_29             EXTI1_SECCFGR1_SEC29  /*!< Secure Line 29 */
#define LL_EXTI1_SEC_30             EXTI1_SECCFGR1_SEC30  /*!< Secure Line 30 */
#define LL_EXTI1_SEC_31             EXTI1_SECCFGR1_SEC31  /*!< Secure Line 31 */

#define LL_EXTI1_SEC_ALL_0_31 \
  ( LL_EXTI1_SEC_0 | LL_EXTI1_SEC_1  | LL_EXTI1_SEC_2 | \
    LL_EXTI1_SEC_3  | LL_EXTI1_SEC_4  | LL_EXTI1_SEC_5 | \
    LL_EXTI1_SEC_6  | LL_EXTI1_SEC_7  | LL_EXTI1_SEC_8 | \
    LL_EXTI1_SEC_9  | LL_EXTI1_SEC_10 | LL_EXTI1_SEC_11 | \
    LL_EXTI1_SEC_12 | LL_EXTI1_SEC_13 | LL_EXTI1_SEC_14 | \
    LL_EXTI1_SEC_15 | LL_EXTI1_SEC_16 | LL_EXTI1_SEC_17 | \
    LL_EXTI1_SEC_18 | LL_EXTI1_SEC_19 | \
    LL_EXTI1_SEC_21 | LL_EXTI1_SEC_22 | LL_EXTI1_SEC_23 | \
    LL_EXTI1_SEC_24 | LL_EXTI1_SEC_25 | LL_EXTI1_SEC_26 | \
    LL_EXTI1_SEC_27 | LL_EXTI1_SEC_28 | LL_EXTI1_SEC_29 | \
    LL_EXTI1_SEC_30 | LL_EXTI1_SEC_31)
/*!< All Extended secure line not reserved*/


#define LL_EXTI1_SEC_32             EXTI1_SECCFGR2_SEC32   /*!< Secure Line 0 */
#define LL_EXTI1_SEC_33             EXTI1_SECCFGR2_SEC33   /*!< Secure Line 1 */
#define LL_EXTI1_SEC_34             EXTI1_SECCFGR2_SEC34   /*!< Secure Line 2 */
/*#define LL_EXTI1_SEC_35             EXTI1_SECCFGR2_SEC35   !< Secure Line 3 */
#define LL_EXTI1_SEC_36             EXTI1_SECCFGR2_SEC36   /*!< Secure Line 4 */
#define LL_EXTI1_SEC_37             EXTI1_SECCFGR2_SEC37   /*!< Secure Line 5 */
#define LL_EXTI1_SEC_38             EXTI1_SECCFGR2_SEC38   /*!< Secure Line 6 */
#define LL_EXTI1_SEC_39             EXTI1_SECCFGR2_SEC39   /*!< Secure Line 7 */
#define LL_EXTI1_SEC_40             EXTI1_SECCFGR2_SEC40   /*!< Secure Line 8 */
#define LL_EXTI1_SEC_41             EXTI1_SECCFGR2_SEC41   /*!< Secure Line 9 */
#define LL_EXTI1_SEC_42             EXTI1_SECCFGR2_SEC42  /*!< Secure Line 10 */
#define LL_EXTI1_SEC_43             EXTI1_SECCFGR2_SEC43  /*!< Secure Line 11 */
#define LL_EXTI1_SEC_44             EXTI1_SECCFGR2_SEC44  /*!< Secure Line 12 */
#define LL_EXTI1_SEC_45             EXTI1_SECCFGR2_SEC45  /*!< Secure Line 13 */
#define LL_EXTI1_SEC_46             EXTI1_SECCFGR2_SEC46  /*!< Secure Line 14 */
#define LL_EXTI1_SEC_47             EXTI1_SECCFGR2_SEC47  /*!< Secure Line 15 */
#define LL_EXTI1_SEC_48             EXTI1_SECCFGR2_SEC48  /*!< Secure Line 16 */
#define LL_EXTI1_SEC_49             EXTI1_SECCFGR2_SEC49  /*!< Secure Line 17 */
#define LL_EXTI1_SEC_50             EXTI1_SECCFGR2_SEC50  /*!< Secure Line 18 */
/*#define LL_EXTI1_SEC_51             EXTI1_SECCFGR2_SEC51  !< Secure Line 19 */
#define LL_EXTI1_SEC_52              EXTI1_SECCFGR2_SEC52  /*!< Secure Line 20 */
#define LL_EXTI1_SEC_53             EXTI1_SECCFGR2_SEC53  /*!< Secure Line 21 */
#define LL_EXTI1_SEC_54             EXTI1_SECCFGR2_SEC54  /*!< Secure Line 22 */
#define LL_EXTI1_SEC_55             EXTI1_SECCFGR2_SEC55  /*!< Secure Line 23 */
#define LL_EXTI1_SEC_56             EXTI1_SECCFGR2_SEC56  /*!< Secure Line 24 */
#define LL_EXTI1_SEC_57             EXTI1_SECCFGR2_SEC57  /*!< Secure Line 25 */
/*#define LL_EXTI1_SEC_58             EXTI1_SECCFGR2_SEC58  !< Secure Line 26 */
#define LL_EXTI1_SEC_59             EXTI1_SECCFGR2_SEC59  /*!< Secure Line 27 */
#define LL_EXTI1_SEC_60             EXTI1_SECCFGR2_SEC60  /*!< Secure Line 28 */
#define LL_EXTI1_SEC_61             EXTI1_SECCFGR2_SEC61  /*!< Secure Line 29 */
#define LL_EXTI1_SEC_62             EXTI1_SECCFGR2_SEC62  /*!< Secure Line 30 */
/*#define LL_EXTI1_SEC_63             EXTI1_SECCFGR2_SEC63  !< Secure Line 31 */

#define LL_EXTI1_SEC_ALL_32_63 \
  ( LL_EXTI1_SEC_32 | LL_EXTI1_SEC_33 | LL_EXTI1_SEC_34 | \
    LL_EXTI1_SEC_36 | LL_EXTI1_SEC_37 | LL_EXTI1_SEC_38 | \
    LL_EXTI1_SEC_39 | LL_EXTI1_SEC_40 | LL_EXTI1_SEC_41 | \
    LL_EXTI1_SEC_42 | LL_EXTI1_SEC_43 | LL_EXTI1_SEC_44 | \
    LL_EXTI1_SEC_45 | LL_EXTI1_SEC_46 | LL_EXTI1_SEC_47 | LL_EXTI1_SEC_48 | \
    LL_EXTI1_SEC_49 | LL_EXTI1_SEC_50 | LL_EXTI1_SEC_52 | \
    LL_EXTI1_SEC_53 | LL_EXTI1_SEC_54 | LL_EXTI1_SEC_55 | \
    LL_EXTI1_SEC_56 | LL_EXTI1_SEC_57 | LL_EXTI1_SEC_59 | \
    LL_EXTI1_SEC_60 | LL_EXTI1_SEC_61 | LL_EXTI1_LINE_62 )
/*!< All Extended line not reserved*/

#define LL_EXTI1_SEC_64             EXTI1_SECCFGR3_SEC64   /*!< Secure Line 0 */
#define LL_EXTI1_SEC_65             EXTI1_SECCFGR3_SEC65  /*!< Secure Line 1 */
/*#define LL_EXTI1_SEC_66             EXTI1_SECCFGR3_SEC66   !< Secure Line 2 */
#define LL_EXTI1_SEC_67             EXTI1_SECCFGR3_SEC67  /*!< Secure Line 3 */
#define LL_EXTI1_SEC_68             EXTI1_SECCFGR3_SEC68  /*!< Secure Line 4 */
/*#define LL_EXTI1_SEC_69             EXTI1_SECCFGR3_SEC69   !< Secure Line 5 */
#define LL_EXTI1_SEC_70             EXTI1_SECCFGR3_SEC70  /*!< Secure Line 6 */
/*#define LL_EXTI1_SEC_71             EXTI1_SECCFGR3_SEC71   !< Secure Line 7 */
#define LL_EXTI1_SEC_72             EXTI1_SECCFGR3_SEC72  /*!< Secure Line 8 */
#define LL_EXTI1_SEC_73             EXTI1_SECCFGR3_SEC73  /*!< Secure Line 9 */
#define LL_EXTI1_SEC_74             EXTI1_SECCFGR3_SEC74  /*!< Secure Line 10 */
#define LL_EXTI1_SEC_75             EXTI1_SECCFGR3_SEC75  /*!< Secure Line 11 */
#define LL_EXTI1_SEC_76             EXTI1_SECCFGR3_SEC76  /*!< Secure Line 12 */
#define LL_EXTI1_SEC_77             EXTI1_SECCFGR3_SEC77  /*!< Secure Line 13 */
#define LL_EXTI1_SEC_78             EXTI1_SECCFGR3_SEC78  /*!< Secure Line 14 */
#define LL_EXTI1_SEC_79             EXTI1_SECCFGR3_SEC79  /*!< Secure Line 15 */
#define LL_EXTI1_SEC_80             EXTI1_SECCFGR3_SEC80  /*!< Secure Line 16 */
#define LL_EXTI1_SEC_81             EXTI1_SECCFGR3_SEC81  /*!< Secure Line 17 */
#define LL_EXTI1_SEC_82             EXTI1_SECCFGR3_SEC82  /*!< Secure Line 18 */
#define LL_EXTI1_SEC_83             EXTI1_SECCFGR3_SEC83  /*!< Secure Line 19 */
#define LL_EXTI1_SEC_84             EXTI1_SECCFGR3_SEC84  /*!< Secure Line 20 */

#define LL_EXTI1_SEC_ALL_64_95 \
  ( LL_EXTI1_SEC_64 | LL_EXTI1_SEC_65 | LL_EXTI1_SEC_67 | \
    LL_EXTI1_SEC_68 |  LL_EXTI1_SEC_70 | \
    LL_EXTI1_SEC_72 | LL_EXTI1_SEC_73 | \
    LL_EXTI1_SEC_74 | LL_EXTI1_SEC_75 | LL_EXTI1_SEC_76 | \
    LL_EXTI1_SEC_77 | LL_EXTI1_SEC_78 | LL_EXTI1_SEC_79 | \
    LL_EXTI1_SEC_80 | LL_EXTI1_SEC_81 | LL_EXTI1_SEC_82 | \
    LL_EXTI1_SEC_83 | LL_EXTI1_SEC_84)
/*!< All Extended secure line not reserved*/

/**
  * @}
  */

/** @defgroup LL_EXTI1_PRIV_x EXTI1 Privilege x
  * @{
  */
#define LL_EXTI1_PRIV_0              EXTI1_PRIVCFGR1_PRIV0   /*!< Secure Line 0 */
#define LL_EXTI1_PRIV_1              EXTI1_PRIVCFGR1_PRIV1   /*!< Secure Line 1 */
#define LL_EXTI1_PRIV_2              EXTI1_PRIVCFGR1_PRIV2   /*!< Secure Line 2 */
#define LL_EXTI1_PRIV_3              EXTI1_PRIVCFGR1_PRIV3   /*!< Secure Line 3 */
#define LL_EXTI1_PRIV_4              EXTI1_PRIVCFGR1_PRIV4   /*!< Secure Line 4 */
#define LL_EXTI1_PRIV_5              EXTI1_PRIVCFGR1_PRIV5   /*!< Secure Line 5 */
#define LL_EXTI1_PRIV_6              EXTI1_PRIVCFGR1_PRIV6   /*!< Secure Line 6 */
#define LL_EXTI1_PRIV_7              EXTI1_PRIVCFGR1_PRIV7   /*!< Secure Line 7 */
#define LL_EXTI1_PRIV_8              EXTI1_PRIVCFGR1_PRIV8   /*!< Secure Line 8 */
#define LL_EXTI1_PRIV_9              EXTI1_PRIVCFGR1_PRIV9   /*!< Secure Line 9 */
#define LL_EXTI1_PRIV_10             EXTI1_PRIVCFGR1_PRIV10  /*!< Secure Line 10 */
#define LL_EXTI1_PRIV_11             EXTI1_PRIVCFGR1_PRIV11  /*!< Secure Line 11 */
#define LL_EXTI1_PRIV_12             EXTI1_PRIVCFGR1_PRIV12  /*!< Secure Line 12 */
#define LL_EXTI1_PRIV_13             EXTI1_PRIVCFGR1_PRIV13  /*!< Secure Line 13 */
#define LL_EXTI1_PRIV_14             EXTI1_PRIVCFGR1_PRIV14  /*!< Secure Line 14 */
#define LL_EXTI1_PRIV_15             EXTI1_PRIVCFGR1_PRIV15  /*!< Secure Line 15 */
#define LL_EXTI1_PRIV_16             EXTI1_PRIVCFGR1_PRIV16  /*!< Secure Line 16 */
#define LL_EXTI1_PRIV_17             EXTI1_PRIVCFGR1_PRIV17  /*!< Secure Line 17 */
#define LL_EXTI1_PRIV_18             EXTI1_PRIVCFGR1_PRIV18  /*!< Secure Line 18 */
#define LL_EXTI1_PRIV_19             EXTI1_PRIVCFGR1_PRIV19  /*!< Secure Line 19 */
/*#define LL_EXTI1_PRIV_20              EXTI1_PRIVCFGR1_PRIV20  !< Secure Line 20 */
#define LL_EXTI1_PRIV_21             EXTI1_PRIVCFGR1_PRIV21  /*!< Secure Line 21 */
#define LL_EXTI1_PRIV_22             EXTI1_PRIVCFGR1_PRIV22  /*!< Secure Line 22 */
#define LL_EXTI1_PRIV_23             EXTI1_PRIVCFGR1_PRIV23  /*!< Secure Line 23 */
#define LL_EXTI1_PRIV_24             EXTI1_PRIVCFGR1_PRIV24  /*!< Secure Line 24 */
#define LL_EXTI1_PRIV_25             EXTI1_PRIVCFGR1_PRIV25  /*!< Secure Line 25 */
#define LL_EXTI1_PRIV_26             EXTI1_PRIVCFGR1_PRIV26  /*!< Secure Line 26 */
#define LL_EXTI1_PRIV_27             EXTI1_PRIVCFGR1_PRIV27  /*!< Secure Line 27 */
#define LL_EXTI1_PRIV_28             EXTI1_PRIVCFGR1_PRIV28  /*!< Secure Line 28 */
#define LL_EXTI1_PRIV_29             EXTI1_PRIVCFGR1_PRIV29  /*!< Secure Line 29 */
#define LL_EXTI1_PRIV_30             EXTI1_PRIVCFGR1_PRIV30  /*!< Secure Line 30 */
#define LL_EXTI1_PRIV_31             EXTI1_PRIVCFGR1_PRIV31  /*!< Secure Line 31 */

#define LL_EXTI1_PRIV_ALL_0_31 \
  ( LL_EXTI1_PRIV_0 | LL_EXTI1_PRIV_1  | LL_EXTI1_PRIV_2 | \
    LL_EXTI1_PRIV_3  | LL_EXTI1_PRIV_4  | LL_EXTI1_PRIV_5 | \
    LL_EXTI1_PRIV_6  | LL_EXTI1_PRIV_7  | LL_EXTI1_PRIV_8 | \
    LL_EXTI1_PRIV_9  | LL_EXTI1_PRIV_10 | LL_EXTI1_PRIV_11 | \
    LL_EXTI1_PRIV_12 | LL_EXTI1_PRIV_13 | LL_EXTI1_PRIV_14 | \
    LL_EXTI1_PRIV_15 | LL_EXTI1_PRIV_16 | LL_EXTI1_PRIV_17 | \
    LL_EXTI1_PRIV_18 | LL_EXTI1_PRIV_19 | \
    LL_EXTI1_PRIV_21 | LL_EXTI1_PRIV_22 | LL_EXTI1_PRIV_23 | \
    LL_EXTI1_PRIV_24 | LL_EXTI1_PRIV_25 | LL_EXTI1_PRIV_26 | \
    LL_EXTI1_PRIV_27 | LL_EXTI1_PRIV_28 | LL_EXTI1_PRIV_29 | \
    LL_EXTI1_PRIV_30 | LL_EXTI1_PRIV_31)
/*!< All Extended secure line not reserved*/

#define LL_EXTI1_PRIV_32             EXTI1_PRIVCFGR2_PRIV32   /*!< Secure Line 0 */
#define LL_EXTI1_PRIV_33             EXTI1_PRIVCFGR2_PRIV33   /*!< Secure Line 1 */
#define LL_EXTI1_PRIV_34             EXTI1_PRIVCFGR2_PRIV34  /*!< Secure Line 2 */
/*#define LL_EXTI1_PRIV_35             EXTI1_PRIVCFGR2_PRIV35  !< Secure Line 3 */
#define LL_EXTI1_PRIV_36             EXTI1_PRIVCFGR2_PRIV36  /*!< Secure Line 4 */
#define LL_EXTI1_PRIV_37             EXTI1_PRIVCFGR2_PRIV37  /*!< Secure Line 5 */
#define LL_EXTI1_PRIV_38             EXTI1_PRIVCFGR2_PRIV38  /*!< Secure Line 6 */
#define LL_EXTI1_PRIV_39             EXTI1_PRIVCFGR2_PRIV39  /*!< Secure Line 7 */
#define LL_EXTI1_PRIV_40             EXTI1_PRIVCFGR2_PRIV40  /*!< Secure Line 8 */
#define LL_EXTI1_PRIV_41             EXTI1_PRIVCFGR2_PRIV41  /*!< Secure Line 9 */
#define LL_EXTI1_PRIV_42             EXTI1_PRIVCFGR2_PRIV42  /*!< Secure Line 10 */
#define LL_EXTI1_PRIV_43             EXTI1_PRIVCFGR2_PRIV43  /*!< Secure Line 11 */
#define LL_EXTI1_PRIV_44             EXTI1_PRIVCFGR2_PRIV44  /*!< Secure Line 12 */
#define LL_EXTI1_PRIV_45             EXTI1_PRIVCFGR2_PRIV45  /*!< Secure Line 13 */
#define LL_EXTI1_PRIV_46             EXTI1_PRIVCFGR2_PRIV46  /*!< Secure Line 14 */
#define LL_EXTI1_PRIV_47             EXTI1_PRIVCFGR2_PRIV47  /*!< Secure Line 15 */
#define LL_EXTI1_PRIV_48             EXTI1_PRIVCFGR2_PRIV48  /*!< Secure Line 16 */
#define LL_EXTI1_PRIV_49             EXTI1_PRIVCFGR2_PRIV49  /*!< Secure Line 17 */
#define LL_EXTI1_PRIV_50             EXTI1_PRIVCFGR2_PRIV50  /*!< Secure Line 18 */
/*#define LL_EXTI1_PRIV_51             EXTI1_PRIVCFGR2_PRIV51  !< Secure Line 19 */
#define LL_EXTI1_PRIV_52              EXTI1_PRIVCFGR2_PRIV52  /*!< Secure Line 20 */
#define LL_EXTI1_PRIV_53             EXTI1_PRIVCFGR2_PRIV53  /*!< Secure Line 21 */
#define LL_EXTI1_PRIV_54             EXTI1_PRIVCFGR2_PRIV54  /*!< Secure Line 22 */
#define LL_EXTI1_PRIV_55             EXTI1_PRIVCFGR2_PRIV55  /*!< Secure Line 23 */
#define LL_EXTI1_PRIV_56             EXTI1_PRIVCFGR2_PRIV56  /*!< Secure Line 24 */
#define LL_EXTI1_PRIV_57             EXTI1_PRIVCFGR2_PRIV57  /*!< Secure Line 25 */
/*#define LL_EXTI1_PRIV_58             EXTI1_PRIVCFGR2_PRIV58  !< Secure Line 26 */
#define LL_EXTI1_PRIV_59             EXTI1_PRIVCFGR2_PRIV59  /*!< Secure Line 27 */
#define LL_EXTI1_PRIV_60             EXTI1_PRIVCFGR2_PRIV60  /*!< Secure Line 28 */
#define LL_EXTI1_PRIV_61             EXTI1_PRIVCFGR2_PRIV61  /*!< Secure Line 29 */
#define LL_EXTI1_PRIV_62             EXTI1_PRIVCFGR2_PRIV62  /*!< Secure Line 30 */
/*#define LL_EXTI1_PRIV_63             EXTI1_PRIVCFGR2_PRIV63  !< Secure Line 31 */

#define LL_EXTI1_PRIV_ALL_32_63 \
  ( LL_EXTI1_PRIV_32 | LL_EXTI1_PRIV_33 | LL_EXTI1_PRIV_34 | \
    LL_EXTI1_PRIV_36 | LL_EXTI1_PRIV_37 | LL_EXTI1_PRIV_38 | \
    LL_EXTI1_PRIV_39 | LL_EXTI1_PRIV_40 | LL_EXTI1_PRIV_41 | \
    LL_EXTI1_PRIV_42 | LL_EXTI1_PRIV_43 | LL_EXTI1_PRIV_44 | \
    LL_EXTI1_PRIV_45 | LL_EXTI1_PRIV_46 | LL_EXTI1_PRIV_47 | LL_EXTI1_PRIV_48 | \
    LL_EXTI1_PRIV_49 | LL_EXTI1_PRIV_50 | LL_EXTI1_PRIV_52 | \
    LL_EXTI1_PRIV_53 | LL_EXTI1_PRIV_54 | LL_EXTI1_PRIV_55 | \
    LL_EXTI1_PRIV_56 | LL_EXTI1_PRIV_57 | LL_EXTI1_PRIV_59 | \
    LL_EXTI1_PRIV_60 | LL_EXTI1_PRIV_61 | LL_EXTI1_LINE_62 )
/*!< All Extended line not reserved*/

#define LL_EXTI1_PRIV_64             EXTI1_PRIVCFGR3_PRIV64   /*!< Secure Line 0 */
#define LL_EXTI1_PRIV_65             EXTI1_PRIVCFGR3_PRIV65  /*!< Secure Line 1 */
#define LL_EXTI1_PRIV_66             EXTI1_PRIVCFGR3_PRIV66  /*!< Secure Line 2 */
#define LL_EXTI1_PRIV_67             EXTI1_PRIVCFGR3_PRIV67  /*!< Secure Line 3 */
#define LL_EXTI1_PRIV_68             EXTI1_PRIVCFGR3_PRIV68  /*!< Secure Line 4 */
#define LL_EXTI1_PRIV_69             EXTI1_PRIVCFGR3_PRIV69  /*!< Secure Line 5 */
#define LL_EXTI1_PRIV_70             EXTI1_PRIVCFGR3_PRIV70  /*!< Secure Line 6 */
#define LL_EXTI1_PRIV_71             EXTI1_PRIVCFGR3_PRIV71  /*!< Secure Line 7 */
#define LL_EXTI1_PRIV_72             EXTI1_PRIVCFGR3_PRIV72  /*!< Secure Line 8 */
#define LL_EXTI1_PRIV_73             EXTI1_PRIVCFGR3_PRIV73  /*!< Secure Line 9 */
#define LL_EXTI1_PRIV_74             EXTI1_PRIVCFGR3_PRIV74  /*!< Secure Line 10 */
#define LL_EXTI1_PRIV_75             EXTI1_PRIVCFGR3_PRIV75  /*!< Secure Line 11 */
#define LL_EXTI1_PRIV_76             EXTI1_PRIVCFGR3_PRIV76  /*!< Secure Line 12 */
#define LL_EXTI1_PRIV_77             EXTI1_PRIVCFGR3_PRIV77  /*!< Secure Line 13 */
#define LL_EXTI1_PRIV_78             EXTI1_PRIVCFGR3_PRIV78  /*!< Secure Line 14 */
#define LL_EXTI1_PRIV_79             EXTI1_PRIVCFGR3_PRIV79  /*!< Secure Line 15 */
#define LL_EXTI1_PRIV_80             EXTI1_PRIVCFGR3_PRIV80  /*!< Secure Line 16 */
#define LL_EXTI1_PRIV_81             EXTI1_PRIVCFGR3_PRIV81  /*!< Secure Line 17 */
#define LL_EXTI1_PRIV_82             EXTI1_PRIVCFGR3_PRIV82  /*!< Secure Line 18 */
#define LL_EXTI1_PRIV_83             EXTI1_PRIVCFGR3_PRIV83  /*!< Secure Line 19 */
#define LL_EXTI1_PRIV_84             EXTI1_PRIVCFGR3_PRIV84  /*!< Secure Line 20 */

