zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_exti.h
#define LL_EXTI1_PRIV_ALL_64_95 \
  ( LL_EXTI1_PRIV_64 | LL_EXTI1_PRIV_65 | LL_EXTI1_PRIV_67 | \
    LL_EXTI1_PRIV_68 |  LL_EXTI1_PRIV_70 | \
    LL_EXTI1_PRIV_72 | LL_EXTI1_PRIV_73 | \
    LL_EXTI1_PRIV_74 | LL_EXTI1_PRIV_75 | LL_EXTI1_PRIV_76 | \
    LL_EXTI1_PRIV_77 | LL_EXTI1_PRIV_78 | LL_EXTI1_PRIV_79 | \
    LL_EXTI1_PRIV_80 | LL_EXTI1_PRIV_81 | LL_EXTI1_PRIV_82 | \
    LL_EXTI1_PRIV_83 | LL_EXTI1_PRIV_84)
/*!< All Extended secure line not reserved*/

/**
  * @}
  */

/** @defgroup LL_EXTI1_EVT_x EXTI1 Event x
  * @{
  */

/* No EMR1 */
/* No EMR2 */

#define LL_EXTI1_EVT_65                 EXTI1_EMR3_EM65   /*!< Extended EVT 65 */

#define LL_EXTI1_EVT_ALL_64_95 \
  ( LL_EXTI1_EVT_65)
/*!< All Extended EVT not reserved*/

/**
  * @}
  */


/** @defgroup LL_EXTI1_EnCIDCFGR_x EXTI1 EnCIDCFGR x
  * @{
  */
#define LL_EXTI1_EnCIDCFGR_0                  (0U)    /*!< E0CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_1                  (1U)    /*!< E1CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_2                  (2U)    /*!< E2CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_3                  (3U)    /*!< E3CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_4                  (4U)    /*!< E4CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_5                  (5U)    /*!< E5CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_6                  (6U)    /*!< E6CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_7                  (7U)    /*!< E7CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_8                  (8U)    /*!< E8CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_9                  (9U)    /*!< E9CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_10                 (10U)   /*!< E10CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_11                 (11U)   /*!< E11CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_12                 (12U)   /*!< E12CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_13                 (13U)   /*!< E13CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_14                 (14U)   /*!< E14CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_15                 (15U)   /*!< E15CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_16                 (16U)   /*!< E16CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_17                 (17U)   /*!< E17CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_18                 (18U)   /*!< E18CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_19                 (19U)   /*!< E19CIDCFGR */
/*!< no E20CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_21                 (21U)   /*!< E21CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_22                 (22U)   /*!< E22CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_23                 (23U)   /*!< E23CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_24                 (24U)   /*!< E24CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_25                 (25U)   /*!< E25CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_26                 (26U)   /*!< E26CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_27                 (27U)   /*!< E27CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_28                 (28U)   /*!< E28CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_29                 (29U)   /*!< E29CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_30                 (30U)   /*!< E30CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_31                 (31U)   /*!< E31CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_32                 (32U)   /*!< E32CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_33                 (33U)   /*!< E33CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_34                 (34U)   /*!< E34CIDCFGR */
/*!< no E35CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_36                 (36U)   /*!< E36CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_37                 (37U)   /*!< E37CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_38                 (38U)   /*!< E38CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_39                 (39U)   /*!< E39CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_40                 (40U)   /*!< E40CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_41                 (41U)   /*!< E41CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_42                 (42U)   /*!< E42CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_43                 (43U)   /*!< E43CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_44                 (44U)   /*!< E44CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_45                 (45U)   /*!< E45CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_46                 (46U)   /*!< E46CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_47                 (47U)   /*!< E47CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_48                 (48U)   /*!< E48CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_49                 (49U)   /*!< E49CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_50                 (50U)   /*!< E50CIDCFGR */
/*!< no E51CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_52                 (52U)   /*!< E52CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_53                 (53U)   /*!< E53CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_54                 (54U)   /*!< E54CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_55                 (55U)   /*!< E55CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_56                 (56U)   /*!< E56CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_57                 (57U)   /*!< E57CIDCFGR */
/*!< no E58CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_59                 (59U)   /*!< E59CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_60                 (60U)   /*!< E60CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_61                 (61U)   /*!< E61CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_62                 (62U)   /*!< E62CIDCFGR */
/*!< no E63CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_64                 (64U)   /*!< E64CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_65                 (65U)   /*!< E65CIDCFGR */
/*!< no E66CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_67                 (67U)   /*!< E67CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_68                 (68U)   /*!< E68CIDCFGR */
/*!< no E69CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_70                 (70U)   /*!< E70CIDCFGR */
/*!< no E71CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_72                 (72U)   /*!< E72CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_73                 (73U)   /*!< E73CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_74                 (74U)   /*!< E74CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_75                 (75U)   /*!< E75CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_76                 (76U)   /*!< E76CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_77                 (77U)   /*!< E77CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_78                 (78U)   /*!< E78CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_79                 (79U)   /*!< E79CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_80                 (80U)   /*!< E80CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_81                 (81U)   /*!< E81CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_82                 (82U)   /*!< E82CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_83                 (83U)   /*!< E83CIDCFGR */
#define LL_EXTI1_EnCIDCFGR_84                 (84U)   /*!< E84CIDCFGR */
#endif /* EXTI1 */

/**
  * @}
  */


/** @defgroup LL_EXTI2_LINE_x EXTI2 Line x
  * @{
  */
#define LL_EXTI2_LINE_0                  EXTI2_IMR1_IM0   /*!< Extended line 0 */
#define LL_EXTI2_LINE_1                  EXTI2_IMR1_IM1   /*!< Extended line 1 */
#define LL_EXTI2_LINE_2                  EXTI2_IMR1_IM2   /*!< Extended line 2 */
#define LL_EXTI2_LINE_3                  EXTI2_IMR1_IM3   /*!< Extended line 3 */
#define LL_EXTI2_LINE_4                  EXTI2_IMR1_IM4   /*!< Extended line 4 */
#define LL_EXTI2_LINE_5                  EXTI2_IMR1_IM5   /*!< Extended line 5 */
#define LL_EXTI2_LINE_6                  EXTI2_IMR1_IM6   /*!< Extended line 6 */
#define LL_EXTI2_LINE_7                  EXTI2_IMR1_IM7   /*!< Extended line 7 */
#define LL_EXTI2_LINE_8                  EXTI2_IMR1_IM8   /*!< Extended line 8 */
#define LL_EXTI2_LINE_9                  EXTI2_IMR1_IM9   /*!< Extended line 9 */
#define LL_EXTI2_LINE_10                 EXTI2_IMR1_IM10   /*!< Extended line 10 */
#define LL_EXTI2_LINE_11                 EXTI2_IMR1_IM11   /*!< Extended line 11 */
#define LL_EXTI2_LINE_12                 EXTI2_IMR1_IM12   /*!< Extended line 12 */
#define LL_EXTI2_LINE_13                 EXTI2_IMR1_IM13   /*!< Extended line 13 */
#define LL_EXTI2_LINE_14                 EXTI2_IMR1_IM14   /*!< Extended line 14 */
#define LL_EXTI2_LINE_15                 EXTI2_IMR1_IM15   /*!< Extended line 15 */
#define LL_EXTI2_LINE_16                 EXTI2_IMR1_IM16   /*!< Extended line 16 */
#define LL_EXTI2_LINE_17                 EXTI2_IMR1_IM17   /*!< Extended line 17 */
#define LL_EXTI2_LINE_18                 EXTI2_IMR1_IM18   /*!< Extended line 18 */
#define LL_EXTI2_LINE_19                 EXTI2_IMR1_IM19   /*!< Extended line 19 */
#define LL_EXTI2_LINE_20                 EXTI2_IMR1_IM20   /*!< Extended line 20 */
#define LL_EXTI2_LINE_21                 EXTI2_IMR1_IM21   /*!< Extended line 21 */
#define LL_EXTI2_LINE_22                 EXTI2_IMR1_IM22   /*!< Extended line 22 */
#define LL_EXTI2_LINE_23                 EXTI2_IMR1_IM23   /*!< Extended line 23 */
#define LL_EXTI2_LINE_24                 EXTI2_IMR1_IM24   /*!< Extended line 24 */
#define LL_EXTI2_LINE_25                 EXTI2_IMR1_IM25   /*!< Extended line 25 */
#define LL_EXTI2_LINE_26                 EXTI2_IMR1_IM26   /*!< Extended line 26 */
#define LL_EXTI2_LINE_27                 EXTI2_IMR1_IM27   /*!< Extended line 27 */
#define LL_EXTI2_LINE_29                 EXTI2_IMR1_IM29   /*!< Extended line 29 */
#define LL_EXTI2_LINE_30                 EXTI2_IMR1_IM30   /*!< Extended line 30 */
#define LL_EXTI2_LINE_31                 EXTI2_IMR1_IM31   /*!< Extended line 31 */

