zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_exti.h
#define LL_EXTI2_LINE_ALL_0_31 \
  ( LL_EXTI2_LINE_0 | LL_EXTI2_LINE_1 | LL_EXTI2_LINE_2 | LL_EXTI2_LINE_3 | \
    LL_EXTI2_LINE_4 | LL_EXTI2_LINE_5 | LL_EXTI2_LINE_6 | \
    LL_EXTI2_LINE_7 | LL_EXTI2_LINE_8 | LL_EXTI2_LINE_9 | \
    LL_EXTI2_LINE_10 | LL_EXTI2_LINE_11 | LL_EXTI2_LINE_12 | \
    LL_EXTI2_LINE_13 | LL_EXTI2_LINE_14 | LL_EXTI2_LINE_15 | \
    LL_EXTI2_LINE_16 | LL_EXTI2_LINE_17 | LL_EXTI2_LINE_18 | \
    LL_EXTI2_LINE_19 | LL_EXTI2_LINE_20 | LL_EXTI2_LINE_21 | \
    LL_EXTI2_LINE_22 | LL_EXTI2_LINE_23 | LL_EXTI2_LINE_24 | \
    LL_EXTI2_LINE_25 | LL_EXTI2_LINE_26 | LL_EXTI2_LINE_27 | \
    LL_EXTI2_LINE_29 | LL_EXTI2_LINE_30 | LL_EXTI2_LINE_31)
/*!< All Extended line not reserved*/

#define LL_EXTI2_DIRECT_LINE_ALL_0_31 \
  ( LL_EXTI2_LINE_16 | LL_EXTI2_LINE_17 | LL_EXTI2_LINE_18 | \
    LL_EXTI2_LINE_19 | LL_EXTI2_LINE_20 | LL_EXTI2_LINE_21 | \
    LL_EXTI2_LINE_22 | LL_EXTI2_LINE_23 | LL_EXTI2_LINE_24 | \
    LL_EXTI2_LINE_25 | LL_EXTI2_LINE_26 | LL_EXTI2_LINE_27 | \
    LL_EXTI2_LINE_29 | LL_EXTI2_LINE_30 | LL_EXTI2_LINE_31)
/*!< All Extended line not reserved*/

#define LL_EXTI2_CONFIG_LINE_ALL_0_31 \
  ( LL_EXTI2_LINE_0 | LL_EXTI2_LINE_1 | LL_EXTI2_LINE_2 | LL_EXTI2_LINE_3 | \
    LL_EXTI2_LINE_4 | LL_EXTI2_LINE_5 | LL_EXTI2_LINE_6 | \
    LL_EXTI2_LINE_7 | LL_EXTI2_LINE_8 | LL_EXTI2_LINE_9 | \
    LL_EXTI2_LINE_10 | LL_EXTI2_LINE_11 | LL_EXTI2_LINE_12 | \
    LL_EXTI2_LINE_13 | LL_EXTI2_LINE_14 | LL_EXTI2_LINE_15 )
/*!< All Extended line not reserved*/

#define LL_EXTI2_LINE_33                 EXTI2_IMR2_IM33   /*!< Extended line 33 */
#define LL_EXTI2_LINE_34                 EXTI2_IMR2_IM34   /*!< Extended line 34 */
#define LL_EXTI2_LINE_35                 EXTI2_IMR2_IM35   /*!< Extended line 35 */
#define LL_EXTI2_LINE_36                 EXTI2_IMR2_IM36   /*!< Extended line 36 */
#define LL_EXTI2_LINE_37                 EXTI2_IMR2_IM37   /*!< Extended line 37 */
#define LL_EXTI2_LINE_38                 EXTI2_IMR2_IM38   /*!< Extended line 38 */
#define LL_EXTI2_LINE_40                 EXTI2_IMR2_IM40   /*!< Extended line 40 */
#define LL_EXTI2_LINE_41                 EXTI2_IMR2_IM41   /*!< Extended line 41 */
#define LL_EXTI2_LINE_42                 EXTI2_IMR2_IM42   /*!< Extended line 42 */
#define LL_EXTI2_LINE_43                 EXTI2_IMR2_IM43   /*!< Extended line 43 */
#define LL_EXTI2_LINE_44                 EXTI2_IMR2_IM44   /*!< Extended line 44 */
#define LL_EXTI2_LINE_46                 EXTI2_IMR2_IM46   /*!< Extended line 46 */
#define LL_EXTI2_LINE_47                 EXTI2_IMR2_IM47   /*!< Extended line 47 */
#define LL_EXTI2_LINE_48                 EXTI2_IMR2_IM48   /*!< Extended line 48 */
#define LL_EXTI2_LINE_49                 EXTI2_IMR2_IM49   /*!< Extended line 49 */
#define LL_EXTI2_LINE_50                 EXTI2_IMR2_IM50   /*!< Extended line 50 */
#define LL_EXTI2_LINE_51                 EXTI2_IMR2_IM51   /*!< Extended line 51 */
#define LL_EXTI2_LINE_52                 EXTI2_IMR2_IM52   /*!< Extended line 52 */
#define LL_EXTI2_LINE_53                 EXTI2_IMR2_IM53   /*!< Extended line 53 */
#define LL_EXTI2_LINE_54                 EXTI2_IMR2_IM54   /*!< Extended line 54 */
#define LL_EXTI2_LINE_55                 EXTI2_IMR2_IM55   /*!< Extended line 55 */
#define LL_EXTI2_LINE_56                 EXTI2_IMR2_IM56   /*!< Extended line 56 */
#define LL_EXTI2_LINE_59                 EXTI2_IMR2_IM59   /*!< Extended line 59 */
#define LL_EXTI2_LINE_60                 EXTI2_IMR2_IM60   /*!< Extended line 60 */
#define LL_EXTI2_LINE_61                 EXTI2_IMR2_IM61   /*!< Extended line 61 */
#define LL_EXTI2_LINE_62                 EXTI2_IMR2_IM62   /*!< Extended line 62 */
#define LL_EXTI2_LINE_63                 EXTI2_IMR2_IM63   /*!< Extended line 63 */

#define LL_EXTI2_LINE_ALL_32_63 \
  ( LL_EXTI2_LINE_33 | LL_EXTI2_LINE_34 | \
    LL_EXTI2_LINE_35 | LL_EXTI2_LINE_36 | LL_EXTI2_LINE_37 | \
    LL_EXTI2_LINE_38 | LL_EXTI2_LINE_40 | LL_EXTI2_LINE_41 | \
    LL_EXTI2_LINE_42 | LL_EXTI2_LINE_43 | LL_EXTI2_LINE_44 | \
    LL_EXTI2_LINE_46 | LL_EXTI2_LINE_47 | LL_EXTI2_LINE_48 | \
    LL_EXTI2_LINE_49 | LL_EXTI2_LINE_50 | LL_EXTI2_LINE_51 | \
    LL_EXTI2_LINE_52 | LL_EXTI2_LINE_53 | LL_EXTI2_LINE_54 | \
    LL_EXTI2_LINE_55 | LL_EXTI2_LINE_56 | LL_EXTI2_LINE_59 | \
    LL_EXTI2_LINE_60 | LL_EXTI2_LINE_61 | LL_EXTI2_LINE_62 | LL_EXTI2_LINE_63)
/*!< All Extended line not reserved*/

#define LL_EXTI2_DIRECT_LINE_ALL_32_63 \
  ( LL_EXTI2_LINE_46 | LL_EXTI2_LINE_47 | LL_EXTI2_LINE_48 | \
    LL_EXTI2_LINE_49 | LL_EXTI2_LINE_50 | LL_EXTI2_LINE_51 | \
    LL_EXTI2_LINE_52 | LL_EXTI2_LINE_53 | LL_EXTI2_LINE_54 | \
    LL_EXTI2_LINE_55 | LL_EXTI2_LINE_56 | LL_EXTI2_LINE_62 | \
    LL_EXTI2_LINE_63)
/*!< All Extended line not reserved*/

#define LL_EXTI2_CONFIG_LINE_ALL_32_63 \
  ( LL_EXTI2_LINE_33 | LL_EXTI2_LINE_34 | \
    LL_EXTI2_LINE_35 | LL_EXTI2_LINE_36 | LL_EXTI2_LINE_37 | \
    LL_EXTI2_LINE_38 | LL_EXTI2_LINE_40 | LL_EXTI2_LINE_41 | \
    LL_EXTI2_LINE_42 | LL_EXTI2_LINE_43 | LL_EXTI2_LINE_44 | \
    LL_EXTI2_LINE_46 | LL_EXTI2_LINE_47 | LL_EXTI2_LINE_48 | \
    LL_EXTI2_LINE_49 | LL_EXTI2_LINE_50 | LL_EXTI2_LINE_51 | \
    LL_EXTI2_LINE_52 | LL_EXTI2_LINE_53 | LL_EXTI2_LINE_54 | \
    LL_EXTI2_LINE_55 | LL_EXTI2_LINE_56 | LL_EXTI2_LINE_59 | \
    LL_EXTI2_LINE_60 | LL_EXTI2_LINE_61 | LL_EXTI2_LINE_62 | \
    LL_EXTI2_LINE_63)
/*!< All Extended line not reserved*/

#define LL_EXTI2_LINE_64                 EXTI2_IMR3_IM64   /*!< Extended line 64 */
#define LL_EXTI2_LINE_65                 EXTI2_IMR3_IM65   /*!< Extended line 65 */
#define LL_EXTI2_LINE_66                 EXTI2_IMR3_IM66   /*!< Extended line 66 */
#define LL_EXTI2_LINE_67                 EXTI2_IMR3_IM67   /*!< Extended line 67 */
#define LL_EXTI2_LINE_68                 EXTI2_IMR3_IM68   /*!< Extended line 68 */
#define LL_EXTI2_LINE_69                 EXTI2_IMR3_IM69   /*!< Extended line 69 */
#define LL_EXTI2_LINE_70                 EXTI2_IMR3_IM70   /*!< Extended line 70 */
#define LL_EXTI2_LINE_76                 EXTI2_IMR3_IM76   /*!< Extended line 76 */

#define LL_EXTI2_LINE_ALL_64_95 \
  ( LL_EXTI2_LINE_64 | LL_EXTI2_LINE_65 | LL_EXTI2_LINE_66 | \
    LL_EXTI2_LINE_67 | LL_EXTI2_LINE_68 | LL_EXTI2_LINE_69 | \
    LL_EXTI2_LINE_70 | LL_EXTI2_LINE_76)
/*!< All Extended line not reserved*/

#define LL_EXTI2_DIRECT_LINE_ALL_64_95 \
  ( LL_EXTI2_LINE_67 | LL_EXTI2_LINE_68 | LL_EXTI2_LINE_69 | \
    LL_EXTI2_LINE_70 | LL_EXTI2_LINE_76)
/*!< All Extended line not reserved*/

#define LL_EXTI2_CONFIG_LINE_ALL_64_95 \
  ( LL_EXTI2_LINE_64 | LL_EXTI2_LINE_65 | LL_EXTI2_LINE_66 )
/*!< All Extended line not reserved*/

/**
  * @}
  */

/** @defgroup LL_EXTI2_EVT_x EXTI2 Event x
  * @{
  */
#define LL_EXTI2_EVT_0                  EXTI2_EMR1_EM0   /*!< Extended EVT 0 */
#define LL_EXTI2_EVT_1                  EXTI2_EMR1_EM1   /*!< Extended EVT 1 */
#define LL_EXTI2_EVT_2                  EXTI2_EMR1_EM2   /*!< Extended EVT 2 */
#define LL_EXTI2_EVT_3                  EXTI2_EMR1_EM3   /*!< Extended EVT 3 */
#define LL_EXTI2_EVT_4                  EXTI2_EMR1_EM4   /*!< Extended EVT 4 */
#define LL_EXTI2_EVT_5                  EXTI2_EMR1_EM5   /*!< Extended EVT 5 */
#define LL_EXTI2_EVT_6                  EXTI2_EMR1_EM6   /*!< Extended EVT 6 */
#define LL_EXTI2_EVT_7                  EXTI2_EMR1_EM7   /*!< Extended EVT 7 */
#define LL_EXTI2_EVT_8                  EXTI2_EMR1_EM8   /*!< Extended EVT 8 */
#define LL_EXTI2_EVT_9                  EXTI2_EMR1_EM9   /*!< Extended EVT 9 */
#define LL_EXTI2_EVT_10                 EXTI2_EMR1_EM10   /*!< Extended EVT 10 */
#define LL_EXTI2_EVT_11                 EXTI2_EMR1_EM11   /*!< Extended EVT 11 */
#define LL_EXTI2_EVT_12                 EXTI2_EMR1_EM12   /*!< Extended EVT 12 */
#define LL_EXTI2_EVT_13                 EXTI2_EMR1_EM13   /*!< Extended EVT 13 */
#define LL_EXTI2_EVT_14                 EXTI2_EMR1_EM14   /*!< Extended EVT 14 */
#define LL_EXTI2_EVT_15                 EXTI2_EMR1_EM15   /*!< Extended EVT 15 */

