zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_exti.h
#define LL_EXTI2_EVT_ALL_0_31 \
  ( LL_EXTI2_EVT_0 | LL_EXTI2_EVT_1 | LL_EXTI2_EVT_2 | LL_EXTI2_EVT_3 | \
    LL_EXTI2_EVT_4 | LL_EXTI2_EVT_5 | LL_EXTI2_EVT_6 | \
    LL_EXTI2_EVT_7 | LL_EXTI2_EVT_8 | LL_EXTI2_EVT_9 | \
    LL_EXTI2_EVT_10 | LL_EXTI2_EVT_11 | LL_EXTI2_EVT_12 | \
    LL_EXTI2_EVT_13 | LL_EXTI2_EVT_14 | LL_EXTI2_EVT_15)
/*!< All Extended EVT not reserved*/

#define LL_EXTI2_EVT_59                 EXTI2_EMR2_EM59   /*!< Extended EVT 59 */
#define LL_EXTI2_EVT_60                 EXTI2_EMR2_EM60   /*!< Extended EVT 60 */
#define LL_EXTI2_EVT_61                 EXTI2_EMR2_EM61   /*!< Extended EVT 61 */

#define LL_EXTI2_EVT_ALL_32_63 \
  ( LL_EXTI2_EVT_59 | LL_EXTI2_EVT_60 | LL_EXTI2_EVT_61)
/*!< All Extended EVT not reserved*/

/**
  * @}
  */

/* no CxEMR3 */

/** @defgroup LL_EXTI2_EnCIDCFGR_x EXTI2 EnCIDCFGR x
  * @{
  */
#define LL_EXTI2_EnCIDCFGR_0                  (0U)    /*!< E0CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_1                  (1U)    /*!< E1CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_2                  (2U)    /*!< E2CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_3                  (3U)    /*!< E3CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_4                  (4U)    /*!< E4CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_5                  (5U)    /*!< E5CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_6                  (6U)    /*!< E6CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_7                  (7U)    /*!< E7CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_8                  (8U)    /*!< E8CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_9                  (9U)    /*!< E9CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_10                 (10U)   /*!< E10CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_11                 (11U)   /*!< E11CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_12                 (12U)   /*!< E12CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_13                 (13U)   /*!< E13CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_14                 (14U)   /*!< E14CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_15                 (15U)   /*!< E15CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_16                 (16U)   /*!< E16CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_17                 (17U)   /*!< E17CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_18                 (18U)   /*!< E18CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_19                 (19U)   /*!< E19CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_20                 (20U)   /*!< E20CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_21                 (21U)   /*!< E21CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_22                 (22U)   /*!< E22CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_23                 (23U)   /*!< E23CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_24                 (24U)   /*!< E24CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_25                 (25U)   /*!< E25CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_26                 (26U)   /*!< E26CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_27                 (27U)   /*!< E27CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_29                 (29U)   /*!< E29CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_30                 (30U)   /*!< E30CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_31                 (31U)   /*!< E31CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_33                 (33U)   /*!< E33CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_34                 (34U)   /*!< E34CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_35                 (35U)   /*!< E35CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_36                 (36U)   /*!< E36CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_37                 (37U)   /*!< E37CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_38                 (38U)   /*!< E38CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_40                 (40U)   /*!< E40CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_41                 (41U)   /*!< E41CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_42                 (42U)   /*!< E42CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_43                 (43U)   /*!< E43CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_44                 (44U)   /*!< E44CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_46                 (46U)   /*!< E46CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_47                 (47U)   /*!< E47CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_48                 (48U)   /*!< E48CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_49                 (49U)   /*!< E49CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_50                 (50U)   /*!< E50CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_51                 (51U)   /*!< E51CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_52                 (52U)   /*!< E52CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_53                 (53U)   /*!< E53CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_54                 (54U)   /*!< E54CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_55                 (55U)   /*!< E55CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_56                 (56U)   /*!< E56CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_59                 (59U)   /*!< E59CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_60                 (60U)   /*!< E60CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_61                 (61U)   /*!< E61CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_62                 (62U)   /*!< E62CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_63                 (63U)   /*!< E63CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_64                 (64U)   /*!< E64CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_65                 (65U)   /*!< E65CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_66                 (66U)   /*!< E66CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_67                 (67U)   /*!< E67CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_68                 (68U)   /*!< E68CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_69                 (69U)   /*!< E69CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_70                 (70U)   /*!< E70CIDCFGR */
#define LL_EXTI2_EnCIDCFGR_76                 (76U)   /*!< E76CIDCFGR */

/**
  * @}
  */

/** @defgroup LL_EXTI2_SEC_x EXTI2 Secure x
  * @{
  */
#define LL_EXTI2_SEC_0              EXTI2_SECCFGR1_SEC0   /*!< Secure Line 0 */
#define LL_EXTI2_SEC_1              EXTI2_SECCFGR1_SEC1   /*!< Secure Line 1 */
#define LL_EXTI2_SEC_2              EXTI2_SECCFGR1_SEC2   /*!< Secure Line 2 */
#define LL_EXTI2_SEC_3              EXTI2_SECCFGR1_SEC3   /*!< Secure Line 3 */
#define LL_EXTI2_SEC_4              EXTI2_SECCFGR1_SEC4   /*!< Secure Line 4 */
#define LL_EXTI2_SEC_5              EXTI2_SECCFGR1_SEC5   /*!< Secure Line 5 */
#define LL_EXTI2_SEC_6              EXTI2_SECCFGR1_SEC6   /*!< Secure Line 6 */
#define LL_EXTI2_SEC_7              EXTI2_SECCFGR1_SEC7   /*!< Secure Line 7 */
#define LL_EXTI2_SEC_8              EXTI2_SECCFGR1_SEC8   /*!< Secure Line 8 */
#define LL_EXTI2_SEC_9              EXTI2_SECCFGR1_SEC9   /*!< Secure Line 9 */
#define LL_EXTI2_SEC_10             EXTI2_SECCFGR1_SEC10  /*!< Secure Line 10 */
#define LL_EXTI2_SEC_11             EXTI2_SECCFGR1_SEC11  /*!< Secure Line 11 */
#define LL_EXTI2_SEC_12             EXTI2_SECCFGR1_SEC12  /*!< Secure Line 12 */
#define LL_EXTI2_SEC_13             EXTI2_SECCFGR1_SEC13  /*!< Secure Line 13 */
#define LL_EXTI2_SEC_14             EXTI2_SECCFGR1_SEC14  /*!< Secure Line 14 */
#define LL_EXTI2_SEC_15             EXTI2_SECCFGR1_SEC15  /*!< Secure Line 15 */
#define LL_EXTI2_SEC_16             EXTI2_SECCFGR1_SEC16  /*!< Secure Line 16 */
#define LL_EXTI2_SEC_17             EXTI2_SECCFGR1_SEC17  /*!< Secure Line 17 */
#define LL_EXTI2_SEC_18             EXTI2_SECCFGR1_SEC18  /*!< Secure Line 18 */
#define LL_EXTI2_SEC_19             EXTI2_SECCFGR1_SEC19  /*!< Secure Line 19 */
#define LL_EXTI2_SEC_20             EXTI2_SECCFGR1_SEC20  /*!< Secure Line 20 */
#define LL_EXTI2_SEC_21             EXTI2_SECCFGR1_SEC21  /*!< Secure Line 21 */
#define LL_EXTI2_SEC_22             EXTI2_SECCFGR1_SEC22  /*!< Secure Line 22 */
#define LL_EXTI2_SEC_23             EXTI2_SECCFGR1_SEC23  /*!< Secure Line 23 */
#define LL_EXTI2_SEC_24             EXTI2_SECCFGR1_SEC24  /*!< Secure Line 24 */
#define LL_EXTI2_SEC_25             EXTI2_SECCFGR1_SEC25  /*!< Secure Line 25 */
#define LL_EXTI2_SEC_26             EXTI2_SECCFGR1_SEC26  /*!< Secure Line 26 */
#define LL_EXTI2_SEC_27             EXTI2_SECCFGR1_SEC27  /*!< Secure Line 27 */
/*#define LL_EXTI2_SEC_28             EXTI2_SECCFGR1_SEC28  !< Secure Line 28 */
#define LL_EXTI2_SEC_29             EXTI2_SECCFGR1_SEC29  /*!< Secure Line 29 */
#define LL_EXTI2_SEC_30             EXTI2_SECCFGR1_SEC30  /*!< Secure Line 30 */
#define LL_EXTI2_SEC_31             EXTI2_SECCFGR1_SEC31  /*!< Secure Line 31 */

#define LL_EXTI2_SEC_ALL_0_31 \
  ( LL_EXTI2_SEC_0 | LL_EXTI2_SEC_1 | LL_EXTI2_SEC_2 | LL_EXTI2_SEC_3 | \
    LL_EXTI2_SEC_4 | LL_EXTI2_SEC_5 | LL_EXTI2_SEC_6 | \
    LL_EXTI2_SEC_7 | LL_EXTI2_SEC_8 | LL_EXTI2_SEC_9 | \
    LL_EXTI2_SEC_10 | LL_EXTI2_SEC_11 | LL_EXTI2_SEC_12 | \
    LL_EXTI2_SEC_13 | LL_EXTI2_SEC_14 | LL_EXTI2_SEC_15 | \
    LL_EXTI2_SEC_16 | LL_EXTI2_SEC_17 | LL_EXTI2_SEC_18 | \
    LL_EXTI2_SEC_19 | LL_EXTI2_SEC_20 | LL_EXTI2_SEC_21 | \
    LL_EXTI2_SEC_22 | LL_EXTI2_SEC_23 | LL_EXTI2_SEC_24 | \
    LL_EXTI2_SEC_25 | LL_EXTI2_SEC_26 | LL_EXTI2_SEC_27 | \
    LL_EXTI2_SEC_29 | LL_EXTI2_SEC_30 | LL_EXTI2_SEC_31)
/*!< All Extended line not reserved*/

/* #define LL_EXTI2_SEC_32             EXTI2_SECCFGR2_SEC32   !< Secure Line 32 */
#define LL_EXTI2_SEC_33             EXTI2_SECCFGR2_SEC33   /*!< Secure Line 33 */
#define LL_EXTI2_SEC_34             EXTI2_SECCFGR2_SEC34   /*!< Secure Line 34 */
#define LL_EXTI2_SEC_35             EXTI2_SECCFGR2_SEC35   /*!< Secure Line 34 */
#define LL_EXTI2_SEC_36             EXTI2_SECCFGR2_SEC36   /*!< Secure Line 36 */
#define LL_EXTI2_SEC_37             EXTI2_SECCFGR2_SEC37   /*!< Secure Line 37 */
#define LL_EXTI2_SEC_38             EXTI2_SECCFGR2_SEC38   /*!< Secure Line 38 */
/* #define LL_EXTI2_SEC_39             EXTI2_SECCFGR2_SEC39   !< Secure Line 39 */
#define LL_EXTI2_SEC_40             EXTI2_SECCFGR2_SEC40   /*!< Secure Line 40 */
#define LL_EXTI2_SEC_41             EXTI2_SECCFGR2_SEC41   /*!< Secure Line 41 */
#define LL_EXTI2_SEC_42             EXTI2_SECCFGR2_SEC42   /*!< Secure Line 42 */
#define LL_EXTI2_SEC_43             EXTI2_SECCFGR2_SEC43   /*!< Secure Line 43 */
#define LL_EXTI2_SEC_44             EXTI2_SECCFGR2_SEC44   /*!< Secure Line 44 */
/*#define LL_EXTI2_SEC_45             EXTI2_SECCFGR2_SEC45  !< Secure Line 45 */
#define LL_EXTI2_SEC_46             EXTI2_SECCFGR2_SEC46   /*!< Secure Line 46 */
#define LL_EXTI2_SEC_47             EXTI2_SECCFGR2_SEC47   /*!< Secure Line 47 */
#define LL_EXTI2_SEC_48             EXTI2_SECCFGR2_SEC48   /*!< Secure Line 48 */
#define LL_EXTI2_SEC_49             EXTI2_SECCFGR2_SEC49   /*!< Secure Line 49 */
#define LL_EXTI2_SEC_50             EXTI2_SECCFGR2_SEC50   /*!< Secure Line 50 */
#define LL_EXTI2_SEC_51             EXTI2_SECCFGR2_SEC51   /*!< Secure Line 51 */
#define LL_EXTI2_SEC_52             EXTI2_SECCFGR2_SEC52   /*!< Secure Line 52 */
#define LL_EXTI2_SEC_53             EXTI2_SECCFGR2_SEC53   /*!< Secure Line 53 */
#define LL_EXTI2_SEC_54             EXTI2_SECCFGR2_SEC54   /*!< Secure Line 54 */
#define LL_EXTI2_SEC_55             EXTI2_SECCFGR2_SEC55   /*!< Secure Line 55 */
#define LL_EXTI2_SEC_56             EXTI2_SECCFGR2_SEC56   /*!< Secure Line 56 */
/*#define LL_EXTI2_SEC_57             EXTI2_SECCFGR2_SEC57   !< Secure Line 57 */
/*#define LL_EXTI2_SEC_58             EXTI2_SECCFGR2_SEC58   !< Secure Line 58 */
#define LL_EXTI2_SEC_59             EXTI2_SECCFGR2_SEC59   /*!< Secure Line 59 */
#define LL_EXTI2_SEC_60             EXTI2_SECCFGR2_SEC60   /*!< Secure Line 60 */
#define LL_EXTI2_SEC_61             EXTI2_SECCFGR2_SEC61   /*!< Secure Line 61 */
#define LL_EXTI2_SEC_62             EXTI2_SECCFGR2_SEC62   /*!< Secure Line 62 */
#define LL_EXTI2_SEC_63             EXTI2_SECCFGR2_SEC63   /*!< Secure Line 63 */

#define LL_EXTI2_SEC_ALL_32_63 \
  ( LL_EXTI2_SEC_33 | LL_EXTI2_SEC_34 | \
    LL_EXTI2_SEC_35 | LL_EXTI2_SEC_36 | LL_EXTI2_SEC_37 | \
    LL_EXTI2_SEC_38 | LL_EXTI2_SEC_40 | LL_EXTI2_SEC_41 | \
    LL_EXTI2_SEC_42 | LL_EXTI2_SEC_43 | LL_EXTI2_SEC_44 | \
    LL_EXTI2_SEC_46 | LL_EXTI2_SEC_47 | LL_EXTI2_SEC_48 | \
    LL_EXTI2_SEC_49 | LL_EXTI2_SEC_50 | LL_EXTI2_SEC_51 | \
    LL_EXTI2_SEC_52 | LL_EXTI2_SEC_53 | LL_EXTI2_SEC_54 | \
    LL_EXTI2_SEC_55 | LL_EXTI2_SEC_56 | LL_EXTI2_SEC_59 | \
    LL_EXTI2_SEC_60 | LL_EXTI2_SEC_61 | LL_EXTI2_SEC_62 | \
    LL_EXTI2_SEC_63)
/*!< All Extended line not reserved*/

#define LL_EXTI2_SEC_64             EXTI2_SECCFGR3_SEC64  /*!< Secure Line 64 */
#define LL_EXTI2_SEC_65             EXTI2_SECCFGR3_SEC65  /*!< Secure Line 65 */
#define LL_EXTI2_SEC_66             EXTI2_SECCFGR3_SEC66  /*!< Secure Line 66 */
#define LL_EXTI2_SEC_67             EXTI2_SECCFGR3_SEC67  /*!< Secure Line 67 */
#define LL_EXTI2_SEC_68             EXTI2_SECCFGR3_SEC68  /*!< Secure Line 68 */
#define LL_EXTI2_SEC_69             EXTI2_SECCFGR3_SEC69  /*!< Secure Line 69 */
#define LL_EXTI2_SEC_70             EXTI2_SECCFGR3_SEC70  /*!< Secure Line 70 */
/* #define LL_EXTI2_SEC_71             EXTI2_SECCFGR3_SEC71  !< Secure Line 71 */
/* #define LL_EXTI2_SEC_72             EXTI2_SECCFGR3_SEC72  !< Secure Line 72 */
/* #define LL_EXTI2_SEC_73             EXTI2_SECCFGR3_SEC73  !< Secure Line 73 */
/* #define LL_EXTI2_SEC_74             EXTI2_SECCFGR3_SEC74  !< Secure Line 74 */
/* #define LL_EXTI2_SEC_75             EXTI2_SECCFGR3_SEC75  !< Secure Line 75 */
#define LL_EXTI2_SEC_76             EXTI2_SECCFGR3_SEC76  /*!< Secure Line 76 */

#define LL_EXTI2_SEC_ALL_64_95 \
  ( LL_EXTI2_SEC_64 | LL_EXTI2_SEC_65 | LL_EXTI2_SEC_66 | \
    LL_EXTI2_SEC_67 | LL_EXTI2_SEC_68 | LL_EXTI2_SEC_69 | \
    LL_EXTI2_SEC_70 | LL_EXTI2_SEC_76)
/*!< All Extended line not reserved*/

/**
  * @}
  */

/** @defgroup LL_EXTI2_PRIV_x EXTI2 Privilege x
  * @{
  */
#define LL_EXTI2_PRIV_0              EXTI2_PRIVCFGR1_PRIV0   /*!< Secure Line 0 */
#define LL_EXTI2_PRIV_1              EXTI2_PRIVCFGR1_PRIV1   /*!< Secure Line 1 */
#define LL_EXTI2_PRIV_2              EXTI2_PRIVCFGR1_PRIV2   /*!< Secure Line 2 */
#define LL_EXTI2_PRIV_3              EXTI2_PRIVCFGR1_PRIV3   /*!< Secure Line 3 */
#define LL_EXTI2_PRIV_4              EXTI2_PRIVCFGR1_PRIV4   /*!< Secure Line 4 */
#define LL_EXTI2_PRIV_5              EXTI2_PRIVCFGR1_PRIV5   /*!< Secure Line 5 */
#define LL_EXTI2_PRIV_6              EXTI2_PRIVCFGR1_PRIV6   /*!< Secure Line 6 */
#define LL_EXTI2_PRIV_7              EXTI2_PRIVCFGR1_PRIV7   /*!< Secure Line 7 */
#define LL_EXTI2_PRIV_8              EXTI2_PRIVCFGR1_PRIV8   /*!< Secure Line 8 */
#define LL_EXTI2_PRIV_9              EXTI2_PRIVCFGR1_PRIV9   /*!< Secure Line 9 */
#define LL_EXTI2_PRIV_10             EXTI2_PRIVCFGR1_PRIV10  /*!< Secure Line 10 */
#define LL_EXTI2_PRIV_11             EXTI2_PRIVCFGR1_PRIV11  /*!< Secure Line 11 */
#define LL_EXTI2_PRIV_12             EXTI2_PRIVCFGR1_PRIV12  /*!< Secure Line 12 */
#define LL_EXTI2_PRIV_13             EXTI2_PRIVCFGR1_PRIV13  /*!< Secure Line 13 */
#define LL_EXTI2_PRIV_14             EXTI2_PRIVCFGR1_PRIV14  /*!< Secure Line 14 */
#define LL_EXTI2_PRIV_15             EXTI2_PRIVCFGR1_PRIV15  /*!< Secure Line 15 */
#define LL_EXTI2_PRIV_16             EXTI2_PRIVCFGR1_PRIV16  /*!< Secure Line 16 */
#define LL_EXTI2_PRIV_17             EXTI2_PRIVCFGR1_PRIV17  /*!< Secure Line 17 */
#define LL_EXTI2_PRIV_18             EXTI2_PRIVCFGR1_PRIV18  /*!< Secure Line 18 */
#define LL_EXTI2_PRIV_19             EXTI2_PRIVCFGR1_PRIV19  /*!< Secure Line 19 */
#define LL_EXTI2_PRIV_20             EXTI2_PRIVCFGR1_PRIV20  /*!< Secure Line 20 */
#define LL_EXTI2_PRIV_21             EXTI2_PRIVCFGR1_PRIV21  /*!< Secure Line 21 */
#define LL_EXTI2_PRIV_22             EXTI2_PRIVCFGR1_PRIV22  /*!< Secure Line 22 */
#define LL_EXTI2_PRIV_23             EXTI2_PRIVCFGR1_PRIV23  /*!< Secure Line 23 */
#define LL_EXTI2_PRIV_24             EXTI2_PRIVCFGR1_PRIV24  /*!< Secure Line 24 */
#define LL_EXTI2_PRIV_25             EXTI2_PRIVCFGR1_PRIV25  /*!< Secure Line 25 */
#define LL_EXTI2_PRIV_26             EXTI2_PRIVCFGR1_PRIV26  /*!< Secure Line 26 */
#define LL_EXTI2_PRIV_27             EXTI2_PRIVCFGR1_PRIV27  /*!< Secure Line 27 */
/* #define LL_EXTI2_PRIV_28             EXTI2_PRIVCFGR1_PRIV28  !< Secure Line 28 */
#define LL_EXTI2_PRIV_29             EXTI2_PRIVCFGR1_PRIV29  /*!< Secure Line 29 */
#define LL_EXTI2_PRIV_30             EXTI2_PRIVCFGR1_PRIV30  /*!< Secure Line 30 */
#define LL_EXTI2_PRIV_31             EXTI2_PRIVCFGR1_PRIV31  /*!< Secure Line 31 */

#define LL_EXTI2_PRIV_ALL_0_31 \
  ( LL_EXTI2_PRIV_0 | LL_EXTI2_PRIV_1 | LL_EXTI2_PRIV_2 | LL_EXTI2_PRIV_3 | \
    LL_EXTI2_PRIV_4 | LL_EXTI2_PRIV_5 | LL_EXTI2_PRIV_6 | \
    LL_EXTI2_PRIV_7 | LL_EXTI2_PRIV_8 | LL_EXTI2_PRIV_9 | \
    LL_EXTI2_PRIV_10 | LL_EXTI2_PRIV_11 | LL_EXTI2_PRIV_12 | \
    LL_EXTI2_PRIV_13 | LL_EXTI2_PRIV_14 | LL_EXTI2_PRIV_15 | \
    LL_EXTI2_PRIV_16 | LL_EXTI2_PRIV_17 | LL_EXTI2_PRIV_18 | \
    LL_EXTI2_PRIV_19 | LL_EXTI2_PRIV_20 | LL_EXTI2_PRIV_21 | \
    LL_EXTI2_PRIV_22 | LL_EXTI2_PRIV_23 | LL_EXTI2_PRIV_24 | \
    LL_EXTI2_PRIV_25 | LL_EXTI2_PRIV_26 | LL_EXTI2_PRIV_27 | \
    LL_EXTI2_PRIV_29 | LL_EXTI2_PRIV_30 | LL_EXTI2_PRIV_31)
/*!< All Extended line not reserved*/

