zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_exti.h
/* #define LL_EXTI2_PRIV_32             EXTI2_PRIVCFGR2_PRIV32   !< Secure Line 0 */
#define LL_EXTI2_PRIV_33             EXTI2_PRIVCFGR2_PRIV33  /*!< Secure Line 1 */
#define LL_EXTI2_PRIV_34             EXTI2_PRIVCFGR2_PRIV34  /*!< Secure Line 2 */
#define LL_EXTI2_PRIV_35             EXTI2_PRIVCFGR2_PRIV35  /*!< Secure Line 3 */
#define LL_EXTI2_PRIV_36             EXTI2_PRIVCFGR2_PRIV36  /*!< Secure Line 4 */
#define LL_EXTI2_PRIV_37             EXTI2_PRIVCFGR2_PRIV37  /*!< Secure Line 5 */
#define LL_EXTI2_PRIV_38             EXTI2_PRIVCFGR2_PRIV38  /*!< Secure Line 6 */
/* #define LL_EXTI2_PRIV_39             EXTI2_PRIVCFGR2_PRIV39   !< Secure Line 7 */
#define LL_EXTI2_PRIV_40             EXTI2_PRIVCFGR2_PRIV40  /*!< Secure Line 8 */
#define LL_EXTI2_PRIV_41             EXTI2_PRIVCFGR2_PRIV41  /*!< Secure Line 9 */
#define LL_EXTI2_PRIV_42             EXTI2_PRIVCFGR2_PRIV42  /*!< Secure Line 10 */
#define LL_EXTI2_PRIV_43             EXTI2_PRIVCFGR2_PRIV43  /*!< Secure Line 11 */
#define LL_EXTI2_PRIV_44             EXTI2_PRIVCFGR2_PRIV44  /*!< Secure Line 12 */
/* #define LL_EXTI2_PRIV_45             EXTI2_PRIVCFGR2_PRIV45  !< Secure Line 13 */
#define LL_EXTI2_PRIV_46             EXTI2_PRIVCFGR2_PRIV46  /*!< Secure Line 14 */
#define LL_EXTI2_PRIV_47             EXTI2_PRIVCFGR2_PRIV47 /*!< Secure Line 15 */
#define LL_EXTI2_PRIV_48             EXTI2_PRIVCFGR2_PRIV48 /*!< Secure Line 16 */
#define LL_EXTI2_PRIV_49             EXTI2_PRIVCFGR2_PRIV49 /*!< Secure Line 17 */
#define LL_EXTI2_PRIV_50             EXTI2_PRIVCFGR2_PRIV50 /*!< Secure Line 18 */
#define LL_EXTI2_PRIV_51             EXTI2_PRIVCFGR2_PRIV51 /*!< Secure Line 19 */
#define LL_EXTI2_PRIV_52             EXTI2_PRIVCFGR2_PRIV52  /*!< Secure Line 20 */
#define LL_EXTI2_PRIV_53             EXTI2_PRIVCFGR2_PRIV53 /*!< Secure Line 21 */
#define LL_EXTI2_PRIV_54             EXTI2_PRIVCFGR2_PRIV54  /*!< Secure Line 22 */
#define LL_EXTI2_PRIV_55             EXTI2_PRIVCFGR2_PRIV55  /*!< Secure Line 23 */
#define LL_EXTI2_PRIV_56             EXTI2_PRIVCFGR2_PRIV56  /*!< Secure Line 24 */
/* #define LL_EXTI2_PRIV_57             EXTI2_PRIVCFGR2_PRIV57  !< Secure Line 25 */
/* #define LL_EXTI2_PRIV_58             EXTI2_PRIVCFGR2_PRIV58  !< Secure Line 26 */
#define LL_EXTI2_PRIV_59             EXTI2_PRIVCFGR2_PRIV59  /*!< Secure Line 27 */
#define LL_EXTI2_PRIV_60             EXTI2_PRIVCFGR2_PRIV60  /*!< Secure Line 28 */
#define LL_EXTI2_PRIV_61             EXTI2_PRIVCFGR2_PRIV61  /*!< Secure Line 29 */
#define LL_EXTI2_PRIV_62             EXTI2_PRIVCFGR2_PRIV62  /*!< Secure Line 30 */
#define LL_EXTI2_PRIV_63             EXTI2_PRIVCFGR2_PRIV63  /*!< Secure Line 31 */

#define LL_EXTI2_PRIV_ALL_32_63 \
  ( LL_EXTI2_PRIV_33 | LL_EXTI2_PRIV_34 | \
    LL_EXTI2_PRIV_35 | LL_EXTI2_PRIV_36 | LL_EXTI2_PRIV_37 | \
    LL_EXTI2_PRIV_38 | LL_EXTI2_PRIV_40 | LL_EXTI2_PRIV_41 | \
    LL_EXTI2_PRIV_42 | LL_EXTI2_PRIV_43 | LL_EXTI2_PRIV_44 | \
    LL_EXTI2_PRIV_46 | LL_EXTI2_PRIV_47 | LL_EXTI2_PRIV_48 | \
    LL_EXTI2_PRIV_49 | LL_EXTI2_PRIV_50 | LL_EXTI2_PRIV_51 | \
    LL_EXTI2_PRIV_52 | LL_EXTI2_PRIV_53 | LL_EXTI2_PRIV_54 | \
    LL_EXTI2_PRIV_55 | LL_EXTI2_PRIV_56 | LL_EXTI2_PRIV_59 | \
    LL_EXTI2_PRIV_60 | LL_EXTI2_PRIV_61 | LL_EXTI2_PRIV_62 | \
    LL_EXTI2_PRIV_63)
/*!< All Extended line not reserved*/

#define LL_EXTI2_PRIV_64             EXTI2_PRIVCFGR3_PRIV64  /*!< Secure Line 0 */
#define LL_EXTI2_PRIV_65             EXTI2_PRIVCFGR3_PRIV65  /*!< Secure Line 1 */
#define LL_EXTI2_PRIV_66             EXTI2_PRIVCFGR3_PRIV66  /*!< Secure Line 2 */
#define LL_EXTI2_PRIV_67             EXTI2_PRIVCFGR3_PRIV67  /*!< Secure Line 3 */
#define LL_EXTI2_PRIV_68             EXTI2_PRIVCFGR3_PRIV68  /*!< Secure Line 4 */
#define LL_EXTI2_PRIV_69             EXTI2_PRIVCFGR3_PRIV69  /*!< Secure Line 5 */
#define LL_EXTI2_PRIV_70             EXTI2_PRIVCFGR3_PRIV70  /*!< Secure Line 6 */
/* #define LL_EXTI2_PRIV_71             EXTI2_PRIVCFGR3_PRIV71  !< Secure Line 7 */
/* #define LL_EXTI2_PRIV_72             EXTI2_PRIVCFGR3_PRIV72  !< Secure Line 8 */
/* #define LL_EXTI2_PRIV_73             EXTI2_PRIVCFGR3_PRIV73  !< Secure Line 9 */
/* #define LL_EXTI2_PRIV_74             EXTI2_PRIVCFGR3_PRIV74  !< Secure Line 10 */
/*#define LL_EXTI2_PRIV_75             EXTI2_PRIVCFGR3_PRIV75   !< Secure Line 11 */
#define LL_EXTI2_PRIV_76             EXTI2_PRIVCFGR3_PRIV76  /*!< Secure Line 12 */

#define LL_EXTI2_PRIV_ALL_64_95 \
  ( LL_EXTI2_PRIV_64 | LL_EXTI2_PRIV_65 | LL_EXTI2_PRIV_66 | \
    LL_EXTI2_PRIV_67 | LL_EXTI2_PRIV_68 | LL_EXTI2_PRIV_69 | \
    LL_EXTI2_PRIV_70 | LL_EXTI2_PRIV_76)
/*!< All Extended line not reserved*/

#define IS_EXTI_CID_VALID(__VALUE__) ((__VALUE__) < 4U)


#if defined(USE_FULL_LL_DRIVER)
#define LL_EXTI_LINE_NONE              (0x00000000U)  /*!< None Extended line */
#endif /*USE_FULL_LL_DRIVER*/

/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup EXTI_LL_EC_MODE Mode
  * @{
  */
#define LL_EXTI_MODE_IT                 ((uint8_t)0x00U) /*!< Interrupt Mode */
#define LL_EXTI_MODE_EVENT              ((uint8_t)0x01U) /*!< Event Mode */
#define LL_EXTI_MODE_IT_EVENT           ((uint8_t)0x02U) /*!< Interrupt & Event Mode */
/**
  * @}
  */

/** @defgroup EXTI_LL_EC_TRIGGER Edge Trigger
  * @{
  */
#define LL_EXTI_TRIGGER_NONE            ((uint8_t)0x00U) /*!< No Trigger Mode */
#define LL_EXTI_TRIGGER_RISING          ((uint8_t)0x01U) /*!< Trigger Rising Mode */
#define LL_EXTI_TRIGGER_FALLING         ((uint8_t)0x02U) /*!< Trigger Falling Mode */
#define LL_EXTI_TRIGGER_RISING_FALLING  ((uint8_t)0x03U) /*!< Trigger Rising & Falling Mode */
/**
  * @}
  */


/** @defgroup EXTI_LL_EC_PORT EXTICR Port
  * @{
  */
#define LL_EXTI_EXTICR_PORTA            EXTI_EXTICR1_EXTI0_PA
#define LL_EXTI_EXTICR_PORTB            EXTI_EXTICR1_EXTI0_PB
#define LL_EXTI_EXTICR_PORTC            EXTI_EXTICR1_EXTI0_PC
#define LL_EXTI_EXTICR_PORTD            EXTI_EXTICR1_EXTI0_PD
#define LL_EXTI_EXTICR_PORTE            EXTI_EXTICR1_EXTI0_PE
#define LL_EXTI_EXTICR_PORTF            EXTI_EXTICR1_EXTI0_PF
#define LL_EXTI_EXTICR_PORTG            EXTI_EXTICR1_EXTI0_PG
#define LL_EXTI_EXTICR_PORTH            EXTI_EXTICR1_EXTI0_PH
#define LL_EXTI_EXTICR_PORTI            EXTI_EXTICR1_EXTI0_PI
#define LL_EXTI_EXTICR_PORTJ            EXTI_EXTICR1_EXTI0_PJ
#define LL_EXTI_EXTICR_PORTK            EXTI_EXTICR1_EXTI0_PK
#define LL_EXTI_EXTICR_PORTZ            EXTI_EXTICR1_EXTI0_PZ
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_EXTI_LINE EXTI EXTI LINE
  * @{
  */
#define LL_EXTI_EXTI_LINE0               (0U  << LL_EXTI_REGISTER_PINPOS_SHFT | 0U)  /*!< EXTI_POSITION_0  | EXTICR[0] */
#define LL_EXTI_EXTI_LINE1               (8U  << LL_EXTI_REGISTER_PINPOS_SHFT | 0U)  /*!< EXTI_POSITION_8  | EXTICR[0] */
#define LL_EXTI_EXTI_LINE2               (16U << LL_EXTI_REGISTER_PINPOS_SHFT | 0U)  /*!< EXTI_POSITION_16 | EXTICR[0] */
#define LL_EXTI_EXTI_LINE3               (24U << LL_EXTI_REGISTER_PINPOS_SHFT | 0U)  /*!< EXTI_POSITION_24 | EXTICR[0] */
#define LL_EXTI_EXTI_LINE4               (0U  << LL_EXTI_REGISTER_PINPOS_SHFT | 1U)  /*!< EXTI_POSITION_0  | EXTICR[1] */
#define LL_EXTI_EXTI_LINE5               (8U  << LL_EXTI_REGISTER_PINPOS_SHFT | 1U)  /*!< EXTI_POSITION_8  | EXTICR[1] */
#define LL_EXTI_EXTI_LINE6               (16U << LL_EXTI_REGISTER_PINPOS_SHFT | 1U)  /*!< EXTI_POSITION_16 | EXTICR[1] */
#define LL_EXTI_EXTI_LINE7               (24U << LL_EXTI_REGISTER_PINPOS_SHFT | 1U)  /*!< EXTI_POSITION_24 | EXTICR[1] */
#define LL_EXTI_EXTI_LINE8               (0U  << LL_EXTI_REGISTER_PINPOS_SHFT | 2U)  /*!< EXTI_POSITION_0  | EXTICR[2] */
#define LL_EXTI_EXTI_LINE9               (8U  << LL_EXTI_REGISTER_PINPOS_SHFT | 2U)  /*!< EXTI_POSITION_8  | EXTICR[2] */
#define LL_EXTI_EXTI_LINE10              (16U << LL_EXTI_REGISTER_PINPOS_SHFT | 2U)  /*!< EXTI_POSITION_16 | EXTICR[2] */
#define LL_EXTI_EXTI_LINE11              (24U << LL_EXTI_REGISTER_PINPOS_SHFT | 2U)  /*!< EXTI_POSITION_24 | EXTICR[2] */
#define LL_EXTI_EXTI_LINE12              (0U  << LL_EXTI_REGISTER_PINPOS_SHFT | 3U)  /*!< EXTI_POSITION_0  | EXTICR[3] */
#define LL_EXTI_EXTI_LINE13              (8U  << LL_EXTI_REGISTER_PINPOS_SHFT | 3U)  /*!< EXTI_POSITION_8  | EXTICR[3] */
#define LL_EXTI_EXTI_LINE14              (16U << LL_EXTI_REGISTER_PINPOS_SHFT | 3U)  /*!< EXTI_POSITION_16 | EXTICR[3] */
#define LL_EXTI_EXTI_LINE15              (24U << LL_EXTI_REGISTER_PINPOS_SHFT | 3U)  /*!< EXTI_POSITION_24 | EXTICR[3] */
/**
  * @}
  */
#endif /*USE_FULL_LL_DRIVER*/

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup EXTI_LL_Exported_Macros EXTI Exported Macros
  * @{
  */

