zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_exti.h
/** @defgroup EXTI_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in a specified EXTI register
  * @param  __INSTANCE__ The EXTI instance
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define LL_EXTI_WriteReg(__INSTANCE__, __REG__, __VALUE__) WRITE_REG((__INSTANCE__)->__REG__, __VALUE__)

/**
  * @brief  Read a value in EXTI register
  * @param  __INSTANCE__ The EXTI instance
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_EXTI_ReadReg(__INSTANCE__, __REG__) READ_REG(__INSTANCE__->__REG__)
/**
  * @}
  */

#define IS_EXTI2_INSTANCE(INSTANCE)  ( ((INSTANCE) == EXTI2) )
#if defined (CORE_CM0PLUS)
#define IS_EXTI1_INSTANCE(INSTANCE)  ( 1U < 0 )
#else   /* CORE_CM0PLUS */
#define IS_EXTI1_INSTANCE(INSTANCE)  ( ((INSTANCE) == EXTI1) )
#endif  /* CORE_CM0PLUS */


/**
  * @}
  */


/* Exported functions --------------------------------------------------------*/
/** @defgroup EXTI_LL_Exported_Functions EXTI Exported Functions
  * @{
  */
/** @defgroup EXTI_LL_EF_IT_Management IT_Management
  * @{
  */

/**
  * @brief  Enable ExtiLine Interrupt request for Lines in range 0 to 31
  * @rmtoll IMR1         IMx           LL_EXTI_EnableIT_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C1_EXTI_EnableIT_0_31(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  SET_BIT(EXTIx->C1IMR1, ExtiLine);
}

/**
  * @brief  Enable ExtiLine Interrupt request for Lines in range 0 to 31 for cpu2
  * @rmtoll C2IMR1         IMx           LL_C2_EXTI_EnableIT_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C2_EXTI_EnableIT_0_31(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  SET_BIT(EXTIx->C2IMR1, ExtiLine);
}

/**
  * @brief  Enable ExtiLine Interrupt request for Lines in range 0 to 31 for cpu3
  * @rmtoll C3IMR1         IMx           LL_C3_EXTI_EnableIT_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C3_EXTI_EnableIT_0_31(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  SET_BIT(EXTIx->C3IMR1, ExtiLine);
}

/**
  * @brief  Enable ExtiLine Interrupt request for Lines in range 32 to 63
  * @rmtoll C1IMR2         IMx           LL_EXTI_EnableIT_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C1_EXTI_EnableIT_32_63(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  SET_BIT(EXTIx->C1IMR2, ExtiLine);
}

/**
  * @brief  Enable ExtiLine Interrupt request for Lines in range 32 to 63 for cpu2
  * @rmtoll C2IMR2         IMx           LL_C2_EXTI_EnableIT_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C2_EXTI_EnableIT_32_63(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  SET_BIT(EXTIx->C2IMR2, ExtiLine);
}

/**
  * @brief  Enable ExtiLine Interrupt request for Lines in range 32 to 63 for cpu3
  * @rmtoll C3IMR2         IMx           LL_C3_EXTI_EnableIT_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C3_EXTI_EnableIT_32_63(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  SET_BIT(EXTIx->C3IMR2, ExtiLine);
}

/**
  * @brief  Enable ExtiLine Interrupt request for Lines in range 32 to 63
  * @rmtoll C1IMR3         IMx           LL_EXTI_EnableIT_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_LINE_ALL_64_95
  *         @arg @ref LL_EXTI2_LINE_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C1_EXTI_EnableIT_64_95(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  SET_BIT(EXTIx->C1IMR3, ExtiLine);
}

/**
  * @brief  Enable ExtiLine Interrupt request for Lines in range 32 to 63 for cpu2
  * @rmtoll C2IMR3         IMx           LL_C2_EXTI_EnableIT_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_LINE_ALL_64_95
  *         @arg @ref LL_EXTI2_LINE_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C2_EXTI_EnableIT_64_95(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  SET_BIT(EXTIx->C2IMR3, ExtiLine);
}

/**
  * @brief  Enable ExtiLine Interrupt request for Lines in range 32 to 63 for cpu3
  * @rmtoll C3IMR3         IMx           LL_C3_EXTI_EnableIT_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_LINE_ALL_64_95
  *         @arg @ref LL_EXTI2_LINE_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C3_EXTI_EnableIT_64_95(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  SET_BIT(EXTIx->C3IMR3, ExtiLine);
}

/**
  * @brief  Disable ExtiLine Interrupt request for Lines in range 0 to 31
  * @rmtoll IMR1         IMx           LL_EXTI_DisableIT_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C1_EXTI_DisableIT_0_31(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  CLEAR_BIT(EXTIx->C1IMR1, ExtiLine);
}

/**
  * @brief  Disable ExtiLine Interrupt request for Lines in range 0 to 31 for cpu2
  * @rmtoll C2IMR1         IMx           LL_C2_EXTI_DisableIT_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C2_EXTI_DisableIT_0_31(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  CLEAR_BIT(EXTIx->C2IMR1, ExtiLine);
}

/**
  * @brief  Disable ExtiLine Interrupt request for Lines in range 0 to 31 for cpu3
  * @rmtoll C3IMR1         IMx           LL_C3_EXTI_DisableIT_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C3_EXTI_DisableIT_0_31(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  CLEAR_BIT(EXTIx->C3IMR1, ExtiLine);
}

/**
  * @brief  Disable ExtiLine Interrupt request for Lines in range 32 to 63
  * @rmtoll IMR2         IMx           LL_EXTI_DisableIT_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C1_EXTI_DisableIT_32_63(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  CLEAR_BIT(EXTIx->C1IMR2, ExtiLine);
}

/**
  * @brief  Disable ExtiLine Interrupt request for Lines in range 32 to 63 for cpu2
  * @rmtoll C2IMR2         IMx           LL_C2_EXTI_DisableIT_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C2_EXTI_DisableIT_32_63(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  CLEAR_BIT(EXTIx->C2IMR2, ExtiLine);
}

/**
  * @brief  Disable ExtiLine Interrupt request for Lines in range 32 to 63 for cpu3
  * @rmtoll C3IMR2         IMx           LL_C3_EXTI_DisableIT_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C3_EXTI_DisableIT_32_63(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  CLEAR_BIT(EXTIx->C3IMR2, ExtiLine);
}

/**
  * @brief  Disable ExtiLine Interrupt request for Lines in range 32 to 63
  * @rmtoll C1IMR3         IMx           LL_EXTI_DisableIT_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_LINE_ALL_64_95
  *         @arg @ref LL_EXTI2_LINE_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C1_EXTI_DisableIT_64_95(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  CLEAR_BIT(EXTIx->C1IMR3, ExtiLine);
}

/**
  * @brief  Disable ExtiLine Interrupt request for Lines in range 32 to 63 for cpu2
  * @rmtoll C2IMR3         IMx           LL_C2_EXTI_DisableIT_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_LINE_ALL_64_95
  *         @arg @ref LL_EXTI2_LINE_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C2_EXTI_DisableIT_64_95(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  CLEAR_BIT(EXTIx->C2IMR3, ExtiLine);
}

/**
  * @brief  Disable ExtiLine Interrupt request for Lines in range 32 to 63 for cpu3
  * @rmtoll C3IMR3         IMx           LL_C3_EXTI_DisableIT_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_LINE_ALL_64_95
  *         @arg @ref LL_EXTI2_LINE_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C3_EXTI_DisableIT_64_95(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  CLEAR_BIT(EXTIx->C3IMR3, ExtiLine);
}

/**
  * @brief  Indicate if ExtiLine Interrupt request is enabled for Lines in range 0 to 31
  * @rmtoll IMR1         IMx           LL_EXTI_IsEnabledIT_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_C1_EXTI_IsEnabledIT_0_31(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->C1IMR1, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate if ExtiLine Interrupt request is enabled for Lines in range 0 to 31 for cpu2
  * @rmtoll C2IMR1         IMx           LL_C2_EXTI_IsEnabledIT_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_C2_EXTI_IsEnabledIT_0_31(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->C2IMR1, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate if ExtiLine Interrupt request is enabled for Lines in range 0 to 31 for cpu3
  * @rmtoll C3IMR1         IMx           LL_C3_EXTI_IsEnabledIT_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_C3_EXTI_IsEnabledIT_0_31(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->C3IMR1, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate if ExtiLine Interrupt request is enabled for Lines in range 32 to 63
  * @rmtoll IMR2         IMx           LL_EXTI_IsEnabledIT_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_C1_EXTI_IsEnabledIT_32_63(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->C1IMR2, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate if ExtiLine Interrupt request is enabled for Lines in range 32 to 63 for cpu2
  * @rmtoll C2IMR2         IMx           LL_C2_EXTI_IsEnabledIT_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_C2_EXTI_IsEnabledIT_32_63(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->C2IMR2, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate if ExtiLine Interrupt request is enabled for Lines in range 32 to 63 for cpu3
  * @rmtoll C3IMR2         IMx           LL_C3_EXTI_IsEnabledIT_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_C3_EXTI_IsEnabledIT_32_63(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->C3IMR2, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate if ExtiLine Interrupt request is enabled for Lines in range 32 to 63
  * @rmtoll IMR2         IMx           LL_EXTI_IsEnabledIT_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_LINE_ALL_64_95
  *         @arg @ref LL_EXTI2_LINE_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_C1_EXTI_IsEnabledIT_64_95(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->C1IMR3, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate if ExtiLine Interrupt request is enabled for Lines in range 32 to 63 for cpu2
  * @rmtoll C2IMR2         IMx           LL_C2_EXTI_IsEnabledIT_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_LINE_ALL_64_95
  *         @arg @ref LL_EXTI2_LINE_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_C2_EXTI_IsEnabledIT_64_95(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->C2IMR3, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate if ExtiLine Interrupt request is enabled for Lines in range 32 to 63 for cpu3
  * @rmtoll C3IMR2         IMx           LL_C3_EXTI_IsEnabledIT_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_LINE_ALL_64_95
  *         @arg @ref LL_EXTI2_LINE_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_C3_EXTI_IsEnabledIT_64_95(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->C3IMR3, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup EXTI_LL_EF_Event_Management Event_Management
  * @{
  */


/**
  * @brief  Enable ExtiLine Event request for Lines in range 0 to 31 for cpu2
  * @rmtoll C2EMR1         EMx           LL_C2_EXTI_EnableEvent_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C2_EXTI_EnableEvent_0_31(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  SET_BIT(EXTIx->C2EMR1, ExtiLine);
}

/**
  * @brief  Enable ExtiLine Event request for Lines in range 0 to 31 for cpu3
  * @rmtoll C3EMR1         EMx           LL_C3_EXTI_EnableEvent_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C3_EXTI_EnableEvent_0_31(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  SET_BIT(EXTIx->C3EMR1, ExtiLine);
}


/**
  * @brief  Enable ExtiLine Event request for Lines in range 32 to 63 for cpu2
  * @rmtoll C2EMR2         EMx           LL_C2_EXTI_EnableEvent_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C2_EXTI_EnableEvent_32_63(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  SET_BIT(EXTIx->C2EMR2, ExtiLine);
}

