zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_exti.h
/**
  * @brief  Enable ExtiLine Event request for Lines in range 32 to 63 for cpu3
  * @rmtoll C3EMR2         EMx           LL_C3_EXTI_EnableEvent_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C3_EXTI_EnableEvent_32_63(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  SET_BIT(EXTIx->C3EMR2, ExtiLine);
}


/**
  * @brief  Enable ExtiLine Event request for Lines in range 32 to 63 for cpu2
  * @rmtoll C2EMR3         EMx           LL_C2_EXTI_EnableEvent_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_LINE_ALL_64_95
  *         @arg @ref LL_EXTI2_LINE_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C2_EXTI_EnableEvent_64_95(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  SET_BIT(EXTIx->C2EMR3, ExtiLine);
}


/**
  * @brief  Disable ExtiLine Event request for Lines in range 0 to 31 for cpu2
  * @rmtoll C2EMR1         EMx           LL_C2_EXTI_DisableEvent_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C2_EXTI_DisableEvent_0_31(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  CLEAR_BIT(EXTIx->C2EMR1, ExtiLine);
}

/**
  * @brief  Disable ExtiLine Event request for Lines in range 0 to 31 for cpu3
  * @rmtoll C3EMR1         EMx           LL_C3_EXTI_DisableEvent_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C3_EXTI_DisableEvent_0_31(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  CLEAR_BIT(EXTIx->C3EMR1, ExtiLine);
}


/**
  * @brief  Disable ExtiLine Event request for Lines in range 32 to 63 for cpu2
  * @rmtoll C2EMR2         EMx           LL_C2_EXTI_DisableEvent_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C2_EXTI_DisableEvent_32_63(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  CLEAR_BIT(EXTIx->C2EMR2, ExtiLine);
}

/**
  * @brief  Disable ExtiLine Event request for Lines in range 32 to 63 for cpu3
  * @rmtoll C3EMR2         EMx           LL_C3_EXTI_DisableEvent_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C3_EXTI_DisableEvent_32_63(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  CLEAR_BIT(EXTIx->C3EMR2, ExtiLine);
}


/**
  * @brief  Disable ExtiLine Event request for Lines in range 32 to 63 for cpu2
  * @rmtoll C2EMR3         EMx           LL_C2_EXTI_DisableEvent_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_LINE_ALL_64_95
  *         @arg @ref LL_EXTI2_LINE_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_C2_EXTI_DisableEvent_64_95(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  CLEAR_BIT(EXTIx->C2EMR3, ExtiLine);
}


/**
  * @brief  Indicate if ExtiLine Event request is enabled for Lines in range 0 to 31 for cpu2
  * @rmtoll C2EMR1         EMx           LL_C2_EXTI_IsEnabledEvent_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_C2_EXTI_IsEnabledEvent_0_31(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->C2EMR1, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate if ExtiLine Event request is enabled for Lines in range 0 to 31 for cpu3
  * @rmtoll C3EMR1         EMx           LL_C3_EXTI_IsEnabledEvent_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be one of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_C3_EXTI_IsEnabledEvent_0_31(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->C3EMR1, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}


/**
  * @brief  Indicate if ExtiLine Event request is enabled for Lines in range 32 to 63 for cpu2
  * @rmtoll EMR2         EMx           LL_C2_EXTI_IsEnabledEvent_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_C2_EXTI_IsEnabledEvent_32_63(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->C2EMR2, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate if ExtiLine Event request is enabled for Lines in range 32 to 63 for cpu3
  * @rmtoll EMR2         EMx           LL_C3_EXTI_IsEnabledEvent_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_C3_EXTI_IsEnabledEvent_32_63(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->C3EMR2, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}


/**
  * @brief  Indicate if ExtiLine Event request is enabled for Lines in range 32 to 63 for cpu2
  * @rmtoll C2EMR3         EMx           LL_C2_EXTI_IsEnabledEvent_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_LINE_ALL_64_95
  *         @arg @ref LL_EXTI2_LINE_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_C2_EXTI_IsEnabledEvent_64_95(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->C2EMR3, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup EXTI_LL_EF_Rising_Trigger_Management Rising_Trigger_Management
  * @{
  */

/**
  * @brief  Enable ExtiLine Rising Edge Trigger for Lines in range 0 to 31
  * @note   The configurable wakeup lines are edge-triggered. No glitch must be
  *         generated on these lines. If a rising edge on a configurable interrupt
  *         line occurs during a write operation in the EXTI_RTSR register, the
  *         pending bit is not set.
  *         Rising and falling edge triggers can be set for
  *         the same interrupt line. In this case, both generate a trigger
  *         condition.
  * @rmtoll RTSR1        RTx           LL_EXTI_EnableRisingTrig_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_EnableRisingTrig_0_31(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  SET_BIT(EXTIx->RTSR1, ExtiLine);
}

/**
  * @brief  Enable ExtiLine Rising Edge Trigger for Lines in range 32 to 63
  * @note The configurable wakeup lines are edge-triggered. No glitch must be
  *       generated on these lines. If a rising edge on a configurable interrupt
  *       line occurs during a write operation in the EXTI_RTSR register, the
  *       pending bit is not set.Rising and falling edge triggers can be set for
  *       the same interrupt line. In this case, both generate a trigger
  *       condition.
  * @rmtoll RTSR2        RTx           LL_EXTI_EnableRisingTrig_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_EnableRisingTrig_32_63(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  SET_BIT(EXTIx->RTSR2, ExtiLine);
}

/**
  * @brief  Enable ExtiLine Rising Edge Trigger for Lines in range 32 to 63
  * @note The configurable wakeup lines are edge-triggered. No glitch must be
  *       generated on these lines. If a rising edge on a configurable interrupt
  *       line occurs during a write operation in the EXTI_RTSR register, the
  *       pending bit is not set.Rising and falling edge triggers can be set for
  *       the same interrupt line. In this case, both generate a trigger
  *       condition.
  * @rmtoll RTSR3        RTx           LL_EXTI_EnableRisingTrig_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_LINE_ALL_64_95
  *         @arg @ref LL_EXTI2_LINE_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_EnableRisingTrig_64_95(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  SET_BIT(EXTIx->RTSR3, ExtiLine);
}

/**
  * @brief  Disable ExtiLine Rising Edge Trigger for Lines in range 0 to 31
  * @note The configurable wakeup lines are edge-triggered. No glitch must be
  *       generated on these lines. If a rising edge on a configurable interrupt
  *       line occurs during a write operation in the EXTI_RTSR register, the
  *       pending bit is not set.
  *       Rising and falling edge triggers can be set for
  *       the same interrupt line. In this case, both generate a trigger
  *       condition.
  * @rmtoll RTSR1        RTx           LL_EXTI_DisableRisingTrig_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_DisableRisingTrig_0_31(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  CLEAR_BIT(EXTIx->RTSR1, ExtiLine);
}

/**
  * @brief  Disable ExtiLine Rising Edge Trigger for Lines in range 32 to 63
  * @note The configurable wakeup lines are edge-triggered. No glitch must be
  *       generated on these lines. If a rising edge on a configurable interrupt
  *       line occurs during a write operation in the EXTI_RTSR register, the
  *       pending bit is not set.
  *       Rising and falling edge triggers can be set for
  *       the same interrupt line. In this case, both generate a trigger
  *       condition.
  * @rmtoll RTSR2        RTx           LL_EXTI_DisableRisingTrig_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_DisableRisingTrig_32_63(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  CLEAR_BIT(EXTIx->RTSR2, ExtiLine);
}

/**
  * @brief  Disable ExtiLine Rising Edge Trigger for Lines in range 32 to 63
  * @note The configurable wakeup lines are edge-triggered. No glitch must be
  *       generated on these lines. If a rising edge on a configurable interrupt
  *       line occurs during a write operation in the EXTI_RTSR register, the
  *       pending bit is not set.
  *       Rising and falling edge triggers can be set for
  *       the same interrupt line. In this case, both generate a trigger
  *       condition.
  * @rmtoll RTSR3        RTx           LL_EXTI_DisableRisingTrig_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_LINE_ALL_64_95
  *         @arg @ref LL_EXTI2_LINE_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_DisableRisingTrig_64_95(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  CLEAR_BIT(EXTIx->RTSR3, ExtiLine);
}

/**
  * @brief  Check if rising edge trigger is enabled for Lines in range 0 to 31
  * @rmtoll RTSR1        RTx           LL_EXTI_IsEnabledRisingTrig_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledRisingTrig_0_31(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->RTSR1, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @brief  Check if rising edge trigger is enabled for Lines in range 32 to 63
  * @rmtoll RTSR2        RTx           LL_EXTI_IsEnabledRisingTrig_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledRisingTrig_32_63(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->RTSR2, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @brief  Check if rising edge trigger is enabled for Lines in range 32 to 63
  * @rmtoll RTSR3        RTx           LL_EXTI_IsEnabledRisingTrig_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_LINE_ALL_64_95
  *         @arg @ref LL_EXTI2_LINE_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledRisingTrig_64_95(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->RTSR3, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @}
  */

