zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_exti.h
/** @defgroup EXTI_LL_EF_Falling_Trigger_Management Falling_Trigger_Management
  * @{
  */

/**
  * @brief  Enable ExtiLine Falling Edge Trigger for Lines in range 0 to 31
  * @note The configurable wakeup lines are edge-triggered. No glitch must be
  *       generated on these lines. If a falling edge on a configurable interrupt
  *       line occurs during a write operation in the EXTI_FTSR register, the
  *       pending bit is not set.
  *       Rising and falling edge triggers can be set for
  *       the same interrupt line. In this case, both generate a trigger
  *       condition.
  * @rmtoll FTSR1        FTx           LL_EXTI_EnableFallingTrig_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_EnableFallingTrig_0_31(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  SET_BIT(EXTIx->FTSR1, ExtiLine);
}

/**
  * @brief  Enable ExtiLine Falling Edge Trigger for Lines in range 32 to 63
  * @note The configurable wakeup lines are edge-triggered. No glitch must be
  *       generated on these lines. If a Falling edge on a configurable interrupt
  *       line occurs during a write operation in the EXTI_FTSR register, the
  *       pending bit is not set.
  *       Rising and falling edge triggers can be set for
  *       the same interrupt line. In this case, both generate a trigger
  *       condition.
  * @rmtoll FTSR2        FTx           LL_EXTI_EnableFallingTrig_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_EnableFallingTrig_32_63(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  SET_BIT(EXTIx->FTSR2, ExtiLine);
}

/**
  * @brief  Enable ExtiLine Falling Edge Trigger for Lines in range 32 to 63
  * @note The configurable wakeup lines are edge-triggered. No glitch must be
  *       generated on these lines. If a Falling edge on a configurable interrupt
  *       line occurs during a write operation in the EXTI_FTSR register, the
  *       pending bit is not set.
  *       Rising and falling edge triggers can be set for
  *       the same interrupt line. In this case, both generate a trigger
  *       condition.
  * @rmtoll FTSR3        FTx           LL_EXTI_EnableFallingTrig_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_LINE_ALL_64_95
  *         @arg @ref LL_EXTI2_LINE_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_EnableFallingTrig_64_95(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  SET_BIT(EXTIx->FTSR3, ExtiLine);
}

/**
  * @brief  Disable ExtiLine Falling Edge Trigger for Lines in range 0 to 31
  * @note The configurable wakeup lines are edge-triggered. No glitch must be
  *       generated on these lines. If a Falling edge on a configurable interrupt
  *       line occurs during a write operation in the EXTI_FTSR register, the
  *       pending bit is not set.
  *       Rising and falling edge triggers can be set for the same interrupt line.
  *       In this case, both generate a trigger condition.
  * @rmtoll FTSR1        FTx           LL_EXTI_DisableFallingTrig_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_DisableFallingTrig_0_31(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  CLEAR_BIT(EXTIx->FTSR1, ExtiLine);
}

/**
  * @brief  Disable ExtiLine Falling Edge Trigger for Lines in range 32 to 63
  * @note The configurable wakeup lines are edge-triggered. No glitch must be
  *       generated on these lines. If a Falling edge on a configurable interrupt
  *       line occurs during a write operation in the EXTI_FTSR register, the
  *       pending bit is not set.
  *       Rising and falling edge triggers can be set for the same interrupt line.
  *       In this case, both generate a trigger condition.
  * @rmtoll FTSR2        FTx           LL_EXTI_DisableFallingTrig_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_DisableFallingTrig_32_63(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  CLEAR_BIT(EXTIx->FTSR2, ExtiLine);
}

/**
  * @brief  Disable ExtiLine Falling Edge Trigger for Lines in range 32 to 63
  * @note The configurable wakeup lines are edge-triggered. No glitch must be
  *       generated on these lines. If a Falling edge on a configurable interrupt
  *       line occurs during a write operation in the EXTI_FTSR register, the
  *       pending bit is not set.
  *       Rising and falling edge triggers can be set for the same interrupt line.
  *       In this case, both generate a trigger condition.
  * @rmtoll FTSR3        FTx           LL_EXTI_DisableFallingTrig_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_LINE_ALL_64_95
  *         @arg @ref LL_EXTI2_LINE_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_DisableFallingTrig_64_95(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  CLEAR_BIT(EXTIx->FTSR3, ExtiLine);
}

/**
  * @brief  Check if falling edge trigger is enabled for Lines in range 0 to 31
  * @rmtoll FTSR1        FTx           LL_EXTI_IsEnabledFallingTrig_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledFallingTrig_0_31(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->FTSR1, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @brief  Check if falling edge trigger is enabled for Lines in range 32 to 63
  * @rmtoll FTSR2        FTx           LL_EXTI_IsEnabledFallingTrig_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledFallingTrig_32_63(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->FTSR2, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @brief  Check if falling edge trigger is enabled for Lines in range 32 to 63
  * @rmtoll FTSR3        FTx           LL_EXTI_IsEnabledFallingTrig_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_LINE_ALL_64_95
  *         @arg @ref LL_EXTI2_LINE_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledFallingTrig_64_95(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->FTSR3, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup EXTI_LL_EF_Software_Interrupt_Management Software_Interrupt_Management
  * @{
  */

/**
  * @brief  Generate a software Interrupt Event for Lines in range 0 to 31
  * @note If the interrupt is enabled on this line in the EXTI_IMR1, writing a 1 to
  *       this bit when it is at '0' sets the corresponding pending bit in EXTI_PR1
  *       resulting in an interrupt request generation.
  *       This bit is cleared by clearing the corresponding bit in the EXTI_PR1
  *       register (by writing a 1 into the bit)
  * @rmtoll SWIER1       SWIx          LL_EXTI_GenerateSWI_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_GenerateSWI_0_31(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  SET_BIT(EXTIx->SWIER1, ExtiLine);
}

/**
  * @brief  Generate a software Interrupt Event for Lines in range 32 to 63
  * @note If the interrupt is enabled on this line in the EXTI_IMR2, writing a 1 to
  *       this bit when it is at '0' sets the corresponding pending bit in EXTI_PR2
  *       resulting in an interrupt request generation.
  *       This bit is cleared by clearing the corresponding bit in the EXTI_PR2
  *       register (by writing a 1 into the bit)
  * @rmtoll SWIER2       SWIx          LL_EXTI_GenerateSWI_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_GenerateSWI_32_63(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  SET_BIT(EXTIx->SWIER2, ExtiLine);
}

/**
  * @brief  Generate a software Interrupt Event for Lines in range 32 to 63
  * @note If the interrupt is enabled on this line in the EXTI_IMR2, writing a 1 to
  *       this bit when it is at '0' sets the corresponding pending bit in EXTI_PR2
  *       resulting in an interrupt request generation.
  *       This bit is cleared by clearing the corresponding bit in the EXTI_PR2
  *       register (by writing a 1 into the bit)
  * @rmtoll SWIER3       SWIx          LL_EXTI_GenerateSWI_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_LINE_ALL_64_95
  *         @arg @ref LL_EXTI2_LINE_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_GenerateSWI_64_95(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  SET_BIT(EXTIx->SWIER3, ExtiLine);
}

/**
  * @}
  */

/** @defgroup EXTI_LL_EF_Flag_Management Flag_Management
  * @{
  */

/**
  * @brief  Check if the ExtLine Flag is set or not for Lines in range 0 to 31
  * @note This bit is set when the selected edge event arrives on the interrupt
  *       line. This bit is cleared by writing a 1 to the bit.
  * @rmtoll RPR1          PIFx           LL_EXTI_IsActiveRisingFlag_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsActiveRisingFlag_0_31(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->RPR1, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the ExtLine Flag is set or not for  Lines in range 32 to 63
  * @note This bit is set when the selected edge event arrives on the interrupt
  *       line. This bit is cleared by writing a 1 to the bit.
  * @rmtoll RPR2          PIFx           LL_EXTI_IsActiveRisingFlag_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsActiveRisingFlag_32_63(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->RPR2, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the ExtLine Flag is set or not for  Lines in range 32 to 63
  * @note This bit is set when the selected edge event arrives on the interrupt
  *       line. This bit is cleared by writing a 1 to the bit.
  * @rmtoll RPR3          PIFx           LL_EXTI_IsActiveRisingFlag_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_LINE_ALL_64_95
  *         @arg @ref LL_EXTI2_LINE_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsActiveRisingFlag_64_95(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->RPR3, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @brief  Read ExtLine Combination Flag for Lines in range 0 to 31
  * @note This bit is set when the selected edge event arrives on the interrupt
  *       line. This bit is cleared by writing a 1 to the bit.
  * @rmtoll RPR1          PIFx           LL_EXTI_ReadRisingFlag_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval @note This bit is set when the selected edge event arrives on the interrupt
  */
__STATIC_INLINE uint32_t LL_EXTI_ReadRisingFlag_0_31(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return (uint32_t)(READ_BIT(EXTIx->RPR1, ExtiLine));
}

/**
  * @brief  Read ExtLine Combination Flag for  Lines in range 32 to 63
  * @note This bit is set when the selected edge event arrives on the interrupt
  *       line. This bit is cleared by writing a 1 to the bit.
  * @rmtoll RPR2          PIFx           LL_EXTI_ReadRisingFlag_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval @note This bit is set when the selected edge event arrives on the interrupt
  */
__STATIC_INLINE uint32_t LL_EXTI_ReadRisingFlag_32_63(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return (uint32_t)(READ_BIT(EXTIx->RPR2, ExtiLine));
}

/**
  * @brief  Read ExtLine Combination Flag for  Lines in range 32 to 63
  * @note This bit is set when the selected edge event arrives on the interrupt
  *       line. This bit is cleared by writing a 1 to the bit.
  * @rmtoll RPR3          PIFx           LL_EXTI_ReadRisingFlag_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_LINE_ALL_64_95
  *         @arg @ref LL_EXTI2_LINE_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval @note This bit is set when the selected edge event arrives on the interrupt
  */
__STATIC_INLINE uint32_t LL_EXTI_ReadRisingFlag_64_95(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return (uint32_t)(READ_BIT(EXTIx->RPR3, ExtiLine));
}

/**
  * @brief  Clear ExtLine Flags for Lines in range 0 to 31
  * @note This bit is set when the selected edge event arrives on the interrupt
  *       line. This bit is cleared by writing a 1 to the bit.
  * @rmtoll RPR1          PIFx           LL_EXTI_ClearRisingFlag_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_ClearRisingFlag_0_31(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  WRITE_REG(EXTIx->RPR1, ExtiLine);
}

/**
  * @brief  Clear ExtLine Flags for Lines in range 32 to 63
  * @note This bit is set when the selected edge event arrives on the interrupt
  *       line. This bit is cleared by writing a 1 to the bit.
  * @rmtoll RPR2          PIFx           LL_EXTI_ClearRisingFlag_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_ClearRisingFlag_32_63(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  WRITE_REG(EXTIx->RPR2, ExtiLine);
}

/**
  * @brief  Clear ExtLine Flags for Lines in range 32 to 63
  * @note This bit is set when the selected edge event arrives on the interrupt
  *       line. This bit is cleared by writing a 1 to the bit.
  * @rmtoll RPR3          PIFx           LL_EXTI_ClearRisingFlag_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_LINE_ALL_64_95
  *         @arg @ref LL_EXTI2_LINE_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_ClearRisingFlag_64_95(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  WRITE_REG(EXTIx->RPR3, ExtiLine);
}


/**
  * @brief  Check if the ExtLine Flag is set or not for Lines in range 0 to 31
  * @note This bit is set when the selected edge event arrives on the interrupt
  *       line. This bit is cleared by writing a 1 to the bit.
  * @rmtoll FPR1          PIFx           LL_EXTI_IsActiveFallingFlag_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsActiveFallingFlag_0_31(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->FPR1, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the ExtLine Flag is set or not for  Lines in range 32 to 63
  * @note This bit is set when the selected edge event arrives on the interrupt
  *       line. This bit is cleared by writing a 1 to the bit.
  * @rmtoll FPR2          PIFx           LL_EXTI_IsActiveFallingFlag_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsActiveFallingFlag_32_63(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->FPR2, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the ExtLine Flag is set or not for  Lines in range 32 to 63
  * @note This bit is set when the selected edge event arrives on the interrupt
  *       line. This bit is cleared by writing a 1 to the bit.
  * @rmtoll FPR3          PIFx           LL_EXTI_IsActiveFallingFlag_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_LINE_ALL_64_95
  *         @arg @ref LL_EXTI2_LINE_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_EXTI_IsActiveFallingFlag_64_95(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return ((READ_BIT(EXTIx->FPR3, ExtiLine) == (ExtiLine)) ? 1UL : 0UL);
}

