zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_exti.h
/**
  * @brief  Read ExtLine Combination Flag for Lines in range 0 to 31
  * @note This bit is set when the selected edge event arrives on the interrupt
  *       line. This bit is cleared by writing a 1 to the bit.
  * @rmtoll FPR1          PIFx           LL_EXTI_ReadFallingFlag_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval @note This bit is set when the selected edge event arrives on the interrupt
  */
__STATIC_INLINE uint32_t LL_EXTI_ReadFallingFlag_0_31(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return (uint32_t)(READ_BIT(EXTIx->FPR1, ExtiLine));
}

/**
  * @brief  Read ExtLine Combination Flag for  Lines in range 32 to 63
  * @note This bit is set when the selected edge event arrives on the interrupt
  *       line. This bit is cleared by writing a 1 to the bit.
  * @rmtoll FPR2          PIFx           LL_EXTI_ReadFallingFlag_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval @note This bit is set when the selected edge event arrives on the interrupt
  */
__STATIC_INLINE uint32_t LL_EXTI_ReadFallingFlag_32_63(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return (uint32_t)(READ_BIT(EXTIx->FPR2, ExtiLine));
}

/**
  * @brief  Read ExtLine Combination Flag for  Lines in range 32 to 63
  * @note This bit is set when the selected edge event arrives on the interrupt
  *       line. This bit is cleared by writing a 1 to the bit.
  * @rmtoll FPR3          PIFx           LL_EXTI_ReadFallingFlag_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_LINE_ALL_64_95
  *         @arg @ref LL_EXTI2_LINE_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval @note This bit is set when the selected edge event arrives on the interrupt
  */
__STATIC_INLINE uint32_t LL_EXTI_ReadFallingFlag_64_95(const EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  return (uint32_t)(READ_BIT(EXTIx->FPR3, ExtiLine));
}

/**
  * @brief  Clear ExtLine Flags for Lines in range 0 to 31
  * @note This bit is set when the selected edge event arrives on the interrupt
  *       line. This bit is cleared by writing a 1 to the bit.
  * @rmtoll FPR1          PIFx           LL_EXTI_ClearFallingFlag_0_31
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_LINE_ALL_0_31
  *         @arg @ref LL_EXTI2_LINE_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_ClearFallingFlag_0_31(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  WRITE_REG(EXTIx->FPR1, ExtiLine);
}

/**
  * @brief  Clear ExtLine Flags for Lines in range 32 to 63
  * @note This bit is set when the selected edge event arrives on the interrupt
  *       line. This bit is cleared by writing a 1 to the bit.
  * @rmtoll FPR2          PIFx           LL_EXTI_ClearFallingFlag_32_63
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_LINE_ALL_32_63
  *         @arg @ref LL_EXTI2_LINE_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_ClearFallingFlag_32_63(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  WRITE_REG(EXTIx->FPR2, ExtiLine);
}

/**
  * @brief  Clear ExtLine Flags for Lines in range 32 to 63
  * @note This bit is set when the selected edge event arrives on the interrupt
  *       line. This bit is cleared by writing a 1 to the bit.
  * @rmtoll FPR3          PIFx           LL_EXTI_ClearFallingFlag_64_95
  * @param  EXTIx EXTI Instance
  * @param  ExtiLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_LINE_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_LINE_ALL_64_95
  *         @arg @ref LL_EXTI2_LINE_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_ClearFallingFlag_64_95(EXTI_TypeDef *EXTIx, uint32_t ExtiLine)
{
  WRITE_REG(EXTIx->FPR3, ExtiLine);
}


/* SECCFGRx */

/**
  * @brief  Enable ExtiSecureLine Flags for Lines in range 0 to 31
  * @note This bit is set when the selected line security is enabled
  * @param  EXTIx EXTI Instance
  * @param  ExtiSecureLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_SEC_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_SEC_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_SEC_ALL_0_31
  *         @arg @ref LL_EXTI2_SEC_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_EnableSecure_0_31(EXTI_TypeDef *EXTIx, uint32_t ExtiSecureLine)
{
  SET_BIT(EXTIx->SECCFGR1, ExtiSecureLine);
}
/**
  * @brief  Enable ExtiSecureLine Flags for Lines in range 32 to 63
  * @note This bit is set when the selected line security is enabled
  * @param  EXTIx EXTI Instance
  * @param  ExtiSecureLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_SEC_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_SEC_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_SEC_ALL_32_63
  *         @arg @ref LL_EXTI2_SEC_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_EnableSecure_32_63(EXTI_TypeDef *EXTIx, uint32_t ExtiSecureLine)
{
  SET_BIT(EXTIx->SECCFGR2, ExtiSecureLine);
}

/**
  * @brief  Enable ExtiSecureLine Flags for Lines in range 64 to 95
  * @note This bit is set when the selected line security is enabled
  * @param  EXTIx EXTI Instance
  * @param  ExtiSecureLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_SEC_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_SEC_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_SEC_ALL_64_95
  *         @arg @ref LL_EXTI2_SEC_ALL_64_95
  *         (*) all values are not $defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_EnableSecure_64_95(EXTI_TypeDef *EXTIx, uint32_t ExtiSecureLine)
{
  SET_BIT(EXTIx->SECCFGR3, ExtiSecureLine);
}

/**
  * @brief  Return ExtiSecureLine Combination Flag for Lines in range 0 to 31
  * @note This bit is set when the selected line security is enabled
  * @param  EXTIx EXTI Instance
  * @param  ExtiSecureLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_SEC_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_SEC_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_SEC_ALL_0_31
  *         @arg @ref LL_EXTI2_SEC_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval @note This bit is set when the selected line secure flag is enabled
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledSecure_0_31(const EXTI_TypeDef *EXTIx, uint32_t ExtiSecureLine)
{
  return (uint32_t)(READ_BIT(EXTIx->SECCFGR1, ExtiSecureLine));
}

/**
  * @brief  Return ExtiSecureLine Combination Flag for Lines in range 32 to 63
  * @note This bit is set when the selected line security is enabled
  * @param  EXTIx EXTI Instance
  * @param  ExtiSecureLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_SEC_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_SEC_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_SEC_ALL_32_63
  *         @arg @ref LL_EXTI2_SEC_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval @note This bit is set when the selected line secure flag is enabled
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledSecure_32_63(const EXTI_TypeDef *EXTIx, uint32_t ExtiSecureLine)
{
  return (uint32_t)(READ_BIT(EXTIx->SECCFGR2, ExtiSecureLine));
}

/**
  * @brief  Return ExtiSecureLine Combination Flag for Lines in range 64 to 95
  * @note This bit is set when the selected line security is enabled
  * @param  EXTIx EXTI Instance
  * @param  ExtiSecureLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_SEC_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_SEC_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_SEC_ALL_64_95
  *         @arg @ref LL_EXTI2_SEC_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval @note This bit is set when the selected line secure flag is enabled
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledSecure_64_95(const EXTI_TypeDef *EXTIx, uint32_t ExtiSecureLine)
{
  return (uint32_t)(READ_BIT(EXTIx->SECCFGR3, ExtiSecureLine));
}

/**
  * @brief  Disable ExtiSecureLine Flags for Lines in range 0 to 31
  * @note This bit is set when the selected line security is enabled
  * @param  EXTIx EXTI Instance
  * @param  ExtiSecureLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_SEC_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_SEC_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_SEC_ALL_0_31
  *         @arg @ref LL_EXTI2_SEC_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_DisableSecure_0_31(EXTI_TypeDef *EXTIx, uint32_t ExtiSecureLine)
{
  CLEAR_BIT(EXTIx->SECCFGR1, ExtiSecureLine);
}

/**
  * @brief  Disable ExtiSecureLine Flags for Lines in range 32 to 63
  * @note This bit is set when the selected line security is enabled
  * @param  EXTIx EXTI Instance
  * @param  ExtiSecureLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_SEC_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_SEC_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_SEC_ALL_32_63
  *         @arg @ref LL_EXTI2_SEC_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_DisableSecure_32_63(EXTI_TypeDef *EXTIx, uint32_t ExtiSecureLine)
{
  CLEAR_BIT(EXTIx->SECCFGR2, ExtiSecureLine);
}

/**
  * @brief  Disable ExtiSecureLine Flags for Lines in range 64 to 95
  * @note This bit is set when the selected line security is enabled
  * @param  EXTIx EXTI Instance
  * @param  ExtiSecureLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_SEC_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_SEC_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_SEC_ALL_64_95
  *         @arg @ref LL_EXTI2_SEC_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_DisableSecure_64_95(EXTI_TypeDef *EXTIx, uint32_t ExtiSecureLine)
{
  CLEAR_BIT(EXTIx->SECCFGR3, ExtiSecureLine);
}


/* PRIVCFGRx */

/**
  * @brief  Enable ExtiPrivilegeLine Flags for Lines in range 0 to 31
  * @note This bit is set when the selected line privilege is enabled
  * @param  EXTIx EXTI Instance
  * @param  ExtiPrivilegeLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_PRIV_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_PRIV_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_PRIV_ALL_0_31
  *         @arg @ref LL_EXTI2_PRIV_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_EnablePrivilege_0_31(EXTI_TypeDef *EXTIx, uint32_t ExtiPrivilegeLine)
{
  SET_BIT(EXTIx->PRIVCFGR1, ExtiPrivilegeLine);
}
/**
  * @brief  Enable ExtiPrivilegeLine Flags for Lines in range 32 to 63
  * @note This bit is set when the selected line privilege is enabled
  * @param  EXTIx EXTI Instance
  * @param  ExtiPrivilegeLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_PRIV_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_PRIV_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_PRIV_ALL_32_63
  *         @arg @ref LL_EXTI2_PRIV_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_EnablePrivilege_32_63(EXTI_TypeDef *EXTIx, uint32_t ExtiPrivilegeLine)
{
  SET_BIT(EXTIx->PRIVCFGR2, ExtiPrivilegeLine);
}

/**
  * @brief  Enable ExtiPrivilegeLine Flags for Lines in range 64 to 95
  * @note This bit is set when the selected line privilege is enabled
  * @param  EXTIx EXTI Instance
  * @param  ExtiPrivilegeLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_PRIV_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_PRIV_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_PRIV_ALL_64_95
  *         @arg @ref LL_EXTI2_PRIV_ALL_64_95
  *         (*) all values are not $defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_EnablePrivilege_64_95(EXTI_TypeDef *EXTIx, uint32_t ExtiPrivilegeLine)
{
  SET_BIT(EXTIx->PRIVCFGR3, ExtiPrivilegeLine);
}

/**
  * @brief  Return ExtiPrivilegeLine Combination Flag for Lines in range 0 to 31
  * @note This bit is set when the selected line privilege is enabled
  * @param  EXTIx EXTI Instance
  * @param  ExtiPrivilegeLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_PRIV_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_PRIV_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_PRIV_ALL_0_31
  *         @arg @ref LL_EXTI2_PRIV_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval @note This bit is set when the selected line Privilege flag is enabled
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledPrivilege_0_31(const EXTI_TypeDef *EXTIx, uint32_t ExtiPrivilegeLine)
{
  return (uint32_t)(READ_BIT(EXTIx->PRIVCFGR1, ExtiPrivilegeLine));
}

/**
  * @brief  Return ExtiPrivilegeLine Combination Flag for Lines in range 32 to 63
  * @note This bit is set when the selected line privilege is enabled
  * @param  EXTIx EXTI Instance
  * @param  ExtiPrivilegeLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_PRIV_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_PRIV_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_PRIV_ALL_32_63
  *         @arg @ref LL_EXTI2_PRIV_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval @note This bit is set when the selected line Privilege flag is enabled
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledPrivilege_32_63(const EXTI_TypeDef *EXTIx, uint32_t ExtiPrivilegeLine)
{
  return (uint32_t)(READ_BIT(EXTIx->PRIVCFGR2, ExtiPrivilegeLine));
}

/**
  * @brief  Return ExtiPrivilegeLine Combination Flag for Lines in range 64 to 95
  * @note This bit is set when the selected line privilege is enabled
  * @param  EXTIx EXTI Instance
  * @param  ExtiPrivilegeLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_PRIV_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_PRIV_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_PRIV_ALL_64_95
  *         @arg @ref LL_EXTI2_PRIV_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval @note This bit is set when the selected line Privilege flag is enabled
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledPrivilege_64_95(const EXTI_TypeDef *EXTIx, uint32_t ExtiPrivilegeLine)
{
  return (uint32_t)(READ_BIT(EXTIx->PRIVCFGR3, ExtiPrivilegeLine));
}

/**
  * @brief  Disable ExtiPrivilegeLine Flags for Lines in range 0 to 31
  * @note This bit is set when the selected line privilege is enabled
  * @param  EXTIx EXTI Instance
  * @param  ExtiPrivilegeLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_PRIV_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI2_PRIV_x (with x, the line number from 0 to 31)
  *         @arg @ref LL_EXTI1_PRIV_ALL_0_31
  *         @arg @ref LL_EXTI2_PRIV_ALL_0_31
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_DisablePrivilege_0_31(EXTI_TypeDef *EXTIx, uint32_t ExtiPrivilegeLine)
{
  CLEAR_BIT(EXTIx->PRIVCFGR1, ExtiPrivilegeLine);
}

/**
  * @brief  Disable ExtiPrivilegeLine Flags for Lines in range 32 to 63
  * @note This bit is set when the selected line privilege is enabled
  * @param  EXTIx EXTI Instance
  * @param  ExtiPrivilegeLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_PRIV_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI2_PRIV_x (with x, the line number from 32 to 63)
  *         @arg @ref LL_EXTI1_PRIV_ALL_32_63
  *         @arg @ref LL_EXTI2_PRIV_ALL_32_63
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_DisablePrivilege_32_63(EXTI_TypeDef *EXTIx, uint32_t ExtiPrivilegeLine)
{
  CLEAR_BIT(EXTIx->PRIVCFGR2, ExtiPrivilegeLine);
}

/**
  * @brief  Disable ExtiPrivilegeLine Flags for Lines in range 64 to 95
  * @note This bit is set when the selected line privilege is enabled
  * @param  EXTIx EXTI Instance
  * @param  ExtiPrivilegeLine This parameter can be a combination of the following values(*):
  *         @arg @ref LL_EXTI1_PRIV_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI2_PRIV_x (with x, the line number from 64 to 95)
  *         @arg @ref LL_EXTI1_PRIV_ALL_64_95
  *         @arg @ref LL_EXTI2_PRIV_ALL_64_95
  *         (*) all values are not defined in all instances
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_DisablePrivilege_64_95(EXTI_TypeDef *EXTIx, uint32_t ExtiPrivilegeLine)
{
  CLEAR_BIT(EXTIx->PRIVCFGR3, ExtiPrivilegeLine);
}

/**
  * @brief  Enable Global security, privilege, CID configuration lock
  * @param  EXTIx EXTI Instance
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_EnableGlobalSecurityLock(EXTI_TypeDef *EXTIx)
{
  SET_BIT(EXTIx->LOCKR, EXTI_LOCKR_GLOCK);
}


/**
  * @brief  Disable Global security, privilege, CID configuration lock
  * @param  EXTIx EXTI Instance
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_DisableGlobalSecurityLock(EXTI_TypeDef *EXTIx)
{
  CLEAR_BIT(EXTIx->LOCKR, EXTI_LOCKR_GLOCK);
}

/**
  * @brief  return Global security, privilege, CID configuration lock status
  * @param  EXTIx EXTI Instance
  * @retval true is locked
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnableGlobalSecurityLock(const EXTI_TypeDef *EXTIx)
{
  return ((READ_BIT(EXTIx->LOCKR, EXTI_LOCKR_GLOCK) == (EXTI_LOCKR_GLOCK)) ? 1UL : 0UL);
}


/**
  * @brief  Set  authorised  CID for  accessing a event line configuration
  * @note relevant only in case of  CID filtering active on event input resource
  * @param  EXTIx EXTI Instance
  * @param  evtIndex : LL_EXTIx_EnCIDCFGR_y (from 0 to 95). valid index depends on EXTI instance
  * @param  cid : authorised cid value   2 bits (or 3 bits soon)
  */
__STATIC_INLINE void LL_EXTI_setEventCid(EXTI_TypeDef *EXTIx, uint32_t evtIndex, uint32_t cid)
{
  MODIFY_REG(EXTIx->ECIDCFGR[evtIndex], EXTI_EnCIDCFGR_CID, cid << EXTI_EnCIDCFGR_CID_Pos);
}


/**
  * @brief  Get  authorised  CID for  accessing a non shareable resource
  * @note relevant only in case of  CID filtering active on input resource
  * @param  EXTIx EXTI Instance
  * @param  evtIndex : from 0 to 95. valid index depends on EXTI instance
  * @retval CID for event line configuration
  */
__STATIC_INLINE uint32_t LL_EXTI_getEventCid(const EXTI_TypeDef *EXTIx, uint32_t evtIndex)
{
  return ((READ_REG(EXTIx->ECIDCFGR[evtIndex]) & (EXTI_EnCIDCFGR_CID)) >> EXTI_EnCIDCFGR_CID_Pos) ;
}

/**
  * @brief  Enable CID filtering  to  control event configuration
  * @param  EXTIx EXTI Instance
  * @param  evtIndex : from 0 to 95. valid index depends on EXTI instance
  */
__STATIC_INLINE void LL_EXTI_EnableEventCidFiltering(EXTI_TypeDef *EXTIx, uint32_t evtIndex)
{
  SET_BIT(EXTIx->ECIDCFGR[evtIndex], EXTI_EnCIDCFGR_CFEN);
}

/**
  * @brief  Disable CID filtering  to  control event configuration
  * @param  EXTIx EXTI Instance
  * @param  evtIndex : from 0 to 95. valid index depends on EXTI instance
  */
__STATIC_INLINE void LL_EXTI_DisableEventCidFiltering(EXTI_TypeDef *EXTIx, uint32_t evtIndex)
{
  CLEAR_BIT(EXTIx->ECIDCFGR[evtIndex], EXTI_EnCIDCFGR_CFEN);
}

/**
  * @brief  Check if CID filtering t  control event configuration access is enabled.
  * @param  EXTIx EXTI Instance
  * @param  evtIndex : from 0 to 95. valid index depends on EXTI instance
  * @retval true is filtering enabled
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledEventCidFiltering(const EXTI_TypeDef *EXTIx, uint32_t evtIndex)
{
  return ((READ_BIT(EXTIx->ECIDCFGR[evtIndex], EXTI_EnCIDCFGR_CFEN) == EXTI_EnCIDCFGR_CFEN) ? 1UL : 0UL);
}


/**
  * @brief  Set  authorised  CID for  accessing C1 processor configuration
  * @note relevant only in case of  CID filtering active on processor resource
  * @param  EXTIx EXTI Instance
  * @param  cid : authorised cid value   2 bits (or 3 bits soon)
  */
__STATIC_INLINE void LL_EXTI_setC1ProcessorCid(EXTI_TypeDef *EXTIx, uint32_t cid)
{
  MODIFY_REG(EXTIx->C1CIDCFGR, EXTI_CmCIDCFGR_CID, cid << EXTI_CmCIDCFGR_CID_Pos);
}


/**
  * @brief  Get  authorised  CID for  accessing C1 processor configuration
  * @note relevant only in case of  CID filtering active on input resource
  * @param  EXTIx EXTI Instance
  * @retval CID for C1 processor configuration
  */
__STATIC_INLINE uint32_t LL_EXTI_getC1ProcessorCid(const EXTI_TypeDef *EXTIx)
{
  return ((READ_REG(EXTIx->C1CIDCFGR) & (EXTI_CmCIDCFGR_CID)) >> EXTI_CmCIDCFGR_CID_Pos) ;
}

/**
  * @brief  Enable EXTI CID filtering  to  control processor C1 configuration
  * @param  EXTIx EXTI Instance
  */
__STATIC_INLINE void LL_EXTI_EnableC1ProcessorCidFiltering(EXTI_TypeDef *EXTIx)
{
  SET_BIT(EXTIx->C1CIDCFGR, EXTI_CmCIDCFGR_CFEN);
}

/**
  * @brief  Disable  CID filtering  to  control processor C1 configuration
  * @param  EXTIx EXTI Instance
  */
__STATIC_INLINE void LL_EXTI_DisableC1ProcessorCidFiltering(EXTI_TypeDef *EXTIx)
{
  CLEAR_BIT(EXTIx->C1CIDCFGR, EXTI_CmCIDCFGR_CFEN);
}

