zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_exti.h
/**
  * @brief  Check if CID filtering to control processor C1 configuration access is enabled.
  * @param  EXTIx EXTI Instance
  * @retval true is filtering enabled
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledC1ProcessorCidFiltering(const EXTI_TypeDef *EXTIx)
{
  return ((READ_BIT(EXTIx->C1CIDCFGR, EXTI_CmCIDCFGR_CFEN) == EXTI_CmCIDCFGR_CFEN) ? 1UL : 0UL);
}

/**
  * @brief  Set  authorised  CID for  accessing C2 processor configuration
  * @note relevant only in case of  CID filtering active on processor resource
  * @param  EXTIx EXTI Instance
  * @param  cid : authorised cid value   2 bits (or 3 bits soon)
  */
__STATIC_INLINE void LL_EXTI_setC2ProcessorCid(EXTI_TypeDef *EXTIx, uint32_t cid)
{
  MODIFY_REG(EXTIx->C2CIDCFGR, EXTI_CmCIDCFGR_CID, cid << EXTI_CmCIDCFGR_CID_Pos);
}


/**
  * @brief  Get  authorised  CID for  accessing C2 processor configuration
  * @note relevant only in case of  CID filtering active on input resource
  * @param  EXTIx EXTI Instance
  * @retval CID for C2 processor configuration
  */
__STATIC_INLINE uint32_t LL_EXTI_getC2ProcessorCid(const EXTI_TypeDef *EXTIx)
{
  return ((READ_REG(EXTIx->C2CIDCFGR) & (EXTI_CmCIDCFGR_CID)) >> EXTI_CmCIDCFGR_CID_Pos) ;
}

/**
  * @brief  Enable CID filtering  to  control processor C2 configuration
  * @param  EXTIx EXTI Instance
  */
__STATIC_INLINE void LL_EXTI_EnableC2ProcessorCidFiltering(EXTI_TypeDef *EXTIx)
{
  SET_BIT(EXTIx->C2CIDCFGR, EXTI_CmCIDCFGR_CFEN);
}

/**
  * @brief  Disable CID filtering  to  control processor C2 configuration
  * @param  EXTIx EXTI Instance
  */
__STATIC_INLINE void LL_EXTI_DisableC2ProcessorCidFiltering(EXTI_TypeDef *EXTIx)
{
  CLEAR_BIT(EXTIx->C2CIDCFGR, EXTI_CmCIDCFGR_CFEN);
}

/**
  * @brief  Check if  CID filtering to control processor C2 configuration access is enabled.
  * @param  EXTIx EXTI Instance
  * @retval true is filtering enabled
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledC2ProcessorCidFiltering(const EXTI_TypeDef *EXTIx)
{
  return ((READ_BIT(EXTIx->C2CIDCFGR, EXTI_CmCIDCFGR_CFEN) == EXTI_CmCIDCFGR_CFEN) ? 1UL : 0UL);
}


/**
  * @brief  Set  authorised  CID for  accessing C3 processor configuration
  * @note relevant only in case of  CID filtering active on processor resource
  * @param  EXTIx EXTI2 Instance only
  * @param  cid : authorised cid value   2 bits (or 3 bits soon)
  */
__STATIC_INLINE void LL_EXTI_setC3ProcessorCid(EXTI_TypeDef *EXTIx, uint32_t cid)
{
  MODIFY_REG(EXTIx->C3CIDCFGR, EXTI_CmCIDCFGR_CID, cid << EXTI_CmCIDCFGR_CID_Pos);
}


/**
  * @brief  Get  authorised  CID for  accessing C3 processor configuration
  * @note relevant only in case of  CID filtering active on input resource
  * @param  EXTIx EXTI2 Instance only
  * @retval CID for C3 processor configuration
  */
__STATIC_INLINE uint32_t LL_EXTI_getC3ProcessorCid(const EXTI_TypeDef *EXTIx)
{
  return ((READ_REG(EXTIx->C3CIDCFGR) & (EXTI_CmCIDCFGR_CID)) >> EXTI_CmCIDCFGR_CID_Pos) ;
}


/**
  * @brief  Enable  CID filtering  to  control processor C3 configuration
  * @param  EXTIx EXTI2 Instance only
  */
__STATIC_INLINE void LL_EXTI_EnableC3ProcessorCidFiltering(EXTI_TypeDef *EXTIx)
{
  SET_BIT(EXTIx->C3CIDCFGR, EXTI_CmCIDCFGR_CFEN);
}

/**
  * @brief  Disable CID filtering  to  control processor C3 configuration
  * @param  EXTIx EXTI2 Instance only
  */
__STATIC_INLINE void LL_EXTI_DisableC3ProcessorCidFiltering(EXTI_TypeDef *EXTIx)
{
  CLEAR_BIT(EXTIx->C3CIDCFGR, EXTI_CmCIDCFGR_CFEN);
}

/**
  * @brief  Check if CID filtering to control processor C3 configuration access is enabled.
  * @param  EXTIx EXTI2 Instance only
  * @retval true is filtering enabled
  */
__STATIC_INLINE uint32_t LL_EXTI_IsEnabledC3ProcessorCidFiltering(const EXTI_TypeDef *EXTIx)
{
  return ((READ_BIT(EXTIx->C3CIDCFGR, EXTI_CmCIDCFGR_CFEN) == EXTI_CmCIDCFGR_CFEN) ? 1UL : 0UL);
}


/**
  * @brief  Configure source input for the EXTI external interrupt.
  * @rmtoll EXTIx_EXTICR1 EXTI0         LL_EXTI_SetEXTISource\n
  *         EXTIx_EXTICR1 EXTI1         LL_EXTI_SetEXTISource\n
  *         EXTIx_EXTICR1 EXTI2         LL_EXTI_SetEXTISource\n
  *         EXTIx_EXTICR1 EXTI3         LL_EXTI_SetEXTISource\n
  *         EXTIx_EXTICR2 EXTI4         LL_EXTI_SetEXTISource\n
  *         EXTIx_EXTICR2 EXTI5         LL_EXTI_SetEXTISource\n
  *         EXTIx_EXTICR2 EXTI6         LL_EXTI_SetEXTISource\n
  *         EXTIx_EXTICR2 EXTI7         LL_EXTI_SetEXTISource\n
  *         EXTIx_EXTICR3 EXTI8         LL_EXTI_SetEXTISource\n
  *         EXTIx_EXTICR3 EXTI9         LL_EXTI_SetEXTISource\n
  *         EXTIx_EXTICR3 EXTI10        LL_EXTI_SetEXTISource\n
  *         EXTIx_EXTICR3 EXTI11        LL_EXTI_SetEXTISource\n
  *         EXTIx_EXTICR4 EXTI12        LL_EXTI_SetEXTISource\n
  *         EXTIx_EXTICR4 EXTI13        LL_EXTI_SetEXTISource\n
  *         EXTIx_EXTICR4 EXTI14        LL_EXTI_SetEXTISource\n
  *         EXTIx_EXTICR4 EXTI15        LL_EXTI_SetEXTISource
  * @param  EXTIx EXTI Instance
  * @param  Port This parameter can be one of the following values:
  *         @arg @ref LL_EXTI_EXTICR_PORTA
  *         @arg @ref LL_EXTI_EXTICR_PORTB
  *         @arg @ref LL_EXTI_EXTICR_PORTC
  *         @arg @ref LL_EXTI_EXTICR_PORTD
  *         @arg @ref LL_EXTI_EXTICR_PORTE
  *         @arg @ref LL_EXTI_EXTICR_PORTF
  *         @arg @ref LL_EXTI_EXTICR_PORTG
  *         @arg @ref LL_EXTI_EXTICR_PORTH
  *         @arg @ref LL_EXTI_EXTICR_PORTI
  *         @arg @ref LL_EXTI_EXTICR_PORTJ
  *         @arg @ref LL_EXTI_EXTICR_PORTK
  *         @arg @ref LL_EXTI_EXTICR_PORTZ
  *
  *         (*) value not defined in all devices
  * @param  Line This parameter can be one of the following values:
  *         @arg @ref LL_EXTI_EXTI_LINE0
  *         @arg @ref LL_EXTI_EXTI_LINE1
  *         @arg @ref LL_EXTI_EXTI_LINE2
  *         @arg @ref LL_EXTI_EXTI_LINE3
  *         @arg @ref LL_EXTI_EXTI_LINE4
  *         @arg @ref LL_EXTI_EXTI_LINE5
  *         @arg @ref LL_EXTI_EXTI_LINE6
  *         @arg @ref LL_EXTI_EXTI_LINE7
  *         @arg @ref LL_EXTI_EXTI_LINE8
  *         @arg @ref LL_EXTI_EXTI_LINE9
  *         @arg @ref LL_EXTI_EXTI_LINE10
  *         @arg @ref LL_EXTI_EXTI_LINE11
  *         @arg @ref LL_EXTI_EXTI_LINE12
  *         @arg @ref LL_EXTI_EXTI_LINE13
  *         @arg @ref LL_EXTI_EXTI_LINE14
  *         @arg @ref LL_EXTI_EXTI_LINE15
  * @retval None
  */
__STATIC_INLINE void LL_EXTI_SetEXTISource(EXTI_TypeDef *EXTIx, uint32_t Port, uint32_t Line)
{
  MODIFY_REG(EXTIx->EXTICR[Line & 0x03U], EXTI_EXTICR1_EXTI0 << (Line >> LL_EXTI_REGISTER_PINPOS_SHFT), \
             Port << (Line >> LL_EXTI_REGISTER_PINPOS_SHFT));
}

/**
  * @brief  Get the configured defined for specific EXTI Line
  * @rmtoll EXTIx_EXTICR1 EXTI0         LL_EXTI_GetEXTISource\n
  *         EXTIx_EXTICR1 EXTI1         LL_EXTI_GetEXTISource\n
  *         EXTIx_EXTICR1 EXTI2         LL_EXTI_GetEXTISource\n
  *         EXTIx_EXTICR1 EXTI3         LL_EXTI_GetEXTISource\n
  *         EXTIx_EXTICR2 EXTI4         LL_EXTI_GetEXTISource\n
  *         EXTIx_EXTICR2 EXTI5         LL_EXTI_GetEXTISource\n
  *         EXTIx_EXTICR2 EXTI6         LL_EXTI_GetEXTISource\n
  *         EXTIx_EXTICR2 EXTI7         LL_EXTI_GetEXTISource\n
  *         EXTIx_EXTICR3 EXTI8         LL_EXTI_GetEXTISource\n
  *         EXTIx_EXTICR3 EXTI9         LL_EXTI_GetEXTISource\n
  *         EXTIx_EXTICR3 EXTI10        LL_EXTI_GetEXTISource\n
  *         EXTIx_EXTICR3 EXTI11        LL_EXTI_GetEXTISource\n
  *         EXTIx_EXTICR4 EXTI12        LL_EXTI_GetEXTISource\n
  *         EXTIx_EXTICR4 EXTI13        LL_EXTI_GetEXTISource\n
  *         EXTIx_EXTICR4 EXTI14        LL_EXTI_GetEXTISource\n
  *         EXTIx_EXTICR4 EXTI15        LL_EXTI_GetEXTISource
  * @param  EXTIx EXTI Instance
  * @param  Line This parameter can be one of the following values:
  *         @arg @ref LL_EXTI_EXTI_LINE0
  *         @arg @ref LL_EXTI_EXTI_LINE1
  *         @arg @ref LL_EXTI_EXTI_LINE2
  *         @arg @ref LL_EXTI_EXTI_LINE3
  *         @arg @ref LL_EXTI_EXTI_LINE4
  *         @arg @ref LL_EXTI_EXTI_LINE5
  *         @arg @ref LL_EXTI_EXTI_LINE6
  *         @arg @ref LL_EXTI_EXTI_LINE7
  *         @arg @ref LL_EXTI_EXTI_LINE8
  *         @arg @ref LL_EXTI_EXTI_LINE9
  *         @arg @ref LL_EXTI_EXTI_LINE10
  *         @arg @ref LL_EXTI_EXTI_LINE11
  *         @arg @ref LL_EXTI_EXTI_LINE12
  *         @arg @ref LL_EXTI_EXTI_LINE13
  *         @arg @ref LL_EXTI_EXTI_LINE14
  *         @arg @ref LL_EXTI_EXTI_LINE15
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_EXTI_EXTICR_PORTA
  *         @arg @ref LL_EXTI_EXTICR_PORTB
  *         @arg @ref LL_EXTI_EXTICR_PORTC
  *         @arg @ref LL_EXTI_EXTICR_PORTD
  *         @arg @ref LL_EXTI_EXTICR_PORTE
  *         @arg @ref LL_EXTI_EXTICR_PORTF
  *         @arg @ref LL_EXTI_EXTICR_PORTG
  *         @arg @ref LL_EXTI_EXTICR_PORTH
  *         @arg @ref LL_EXTI_EXTICR_PORTI
  *         @arg @ref LL_EXTI_EXTICR_PORTJ
  *         @arg @ref LL_EXTI_EXTICR_PORTK
  *         @arg @ref LL_EXTI_EXTICR_PORTZ
  */
__STATIC_INLINE uint32_t LL_EXTI_GetEXTISource(const EXTI_TypeDef *EXTIx, uint32_t Line)
{
  return (uint32_t)(READ_BIT(EXTIx->EXTICR[Line & 0x03U],
                             ((uint32_t)EXTI_EXTICR1_EXTI0 << (Line >> LL_EXTI_REGISTER_PINPOS_SHFT))) >>
                    (Line >> LL_EXTI_REGISTER_PINPOS_SHFT));
}


/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup EXTI_LL_EF_Init Initialization and de-initialization functions
  * @{
  */
ErrorStatus LL_EXTI_Init(EXTI_TypeDef *EXTIx, LL_EXTI_InitTypeDef *EXTI_InitStruct);
ErrorStatus LL_EXTI_DeInit(EXTI_TypeDef *EXTIx);
void        LL_EXTI_StructInit(LL_EXTI_InitTypeDef *EXTI_InitStruct);
/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/**
  * @}
  */

/**
  * @}
  */

#endif /* EXTI1 || EXTI2 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __STM32MP2xx_LL_EXTI_H */
